Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
#ifndef _HAPTIC_NV_REG_H_
#define _HAPTIC_NV_REG_H_
/********************************************
 * AW862XX Register List
 *******************************************/
#define AW862XX_REG_ID									(0x00)
#define AW862XX_REG_SYSST								(0x01)
#define AW862XX_REG_SYSINT								(0x02)
#define AW862XX_REG_SYSINTM								(0x03)
#define AW862XX_REG_SYSST2								(0x04)
#define AW862XX_REG_SYSER								(0x05)
#define AW862XX_REG_PLAYCFG2							(0x07)
#define AW862XX_REG_PLAYCFG3							(0x08)
#define AW862XX_REG_PLAYCFG4							(0x09)
#define AW862XX_REG_WAVCFG1								(0x0A)
#define AW862XX_REG_WAVCFG2								(0x0B)
#define AW862XX_REG_WAVCFG3								(0x0C)
#define AW862XX_REG_WAVCFG4								(0x0D)
#define AW862XX_REG_WAVCFG5								(0x0E)
#define AW862XX_REG_WAVCFG6								(0x0F)
#define AW862XX_REG_WAVCFG7								(0x10)
#define AW862XX_REG_WAVCFG8								(0x11)
#define AW862XX_REG_WAVCFG9								(0x12)
#define AW862XX_REG_WAVCFG10							(0x13)
#define AW862XX_REG_WAVCFG11							(0x14)
#define AW862XX_REG_WAVCFG12							(0x15)
#define AW862XX_REG_WAVCFG13							(0x16)
#define AW862XX_REG_CONTCFG1							(0x18)
#define AW862XX_REG_CONTCFG2							(0x19)
#define AW862XX_REG_CONTCFG3							(0x1A)
#define AW862XX_REG_CONTCFG4							(0x1B)
#define AW862XX_REG_CONTCFG5							(0x1C)
#define AW862XX_REG_CONTCFG6							(0x1D)
#define AW862XX_REG_CONTCFG7							(0x1E)
#define AW862XX_REG_CONTCFG8							(0x1F)
#define AW862XX_REG_CONTCFG9							(0x20)
#define AW862XX_REG_CONTCFG10							(0x21)
#define AW862XX_REG_CONTCFG11							(0x22)
#define AW862XX_REG_CONTCFG12							(0x23)
#define AW862XX_REG_CONTCFG13							(0x24)
#define AW862XX_REG_CONTRD14							(0x25)
#define AW862XX_REG_CONTRD15							(0x26)
#define AW862XX_REG_CONTRD16							(0x27)
#define AW862XX_REG_CONTRD17							(0x28)
#define AW862XX_REG_CONTRD18							(0x29)
#define AW862XX_REG_CONTRD19							(0x2A)
#define AW862XX_REG_CONTRD20							(0x2B)
#define AW862XX_REG_CONTRD21							(0x2C)
#define AW862XX_REG_RTPCFG1								(0x2D)
#define AW862XX_REG_RTPCFG2								(0x2E)
#define AW862XX_REG_RTPCFG3								(0x2F)
#define AW862XX_REG_RTPCFG4								(0x30)
#define AW862XX_REG_RTPCFG5								(0x31)
#define AW862XX_REG_RTPDATA								(0x32)
#define AW862XX_REG_TRGCFG1								(0x33)
#define AW862XX_REG_TRGCFG2								(0x34)
#define AW862XX_REG_TRGCFG3								(0x35)
#define AW862XX_REG_TRGCFG4								(0x36)
#define AW862XX_REG_TRGCFG5								(0x37)
#define AW862XX_REG_TRGCFG6								(0x38)
#define AW862XX_REG_TRGCFG7								(0x39)
#define AW862XX_REG_TRGCFG8								(0x3A)
#define AW862XX_REG_GLBCFG2								(0x3C)
#define AW862XX_REG_GLBCFG4								(0x3E)
#define AW862XX_REG_GLBRD5								(0x3F)
#define AW862XX_REG_RAMADDRH							(0x40)
#define AW862XX_REG_RAMADDRL							(0x41)
#define AW862XX_REG_RAMDATA								(0x42)
#define AW862XX_REG_SYSCTRL1							(0x43)
#define AW862XX_REG_SYSCTRL2							(0x44)
#define AW862XX_REG_SYSCTRL3							(0x45)
#define AW862XX_REG_SYSCTRL4							(0x46)
#define AW862XX_REG_SYSCTRL5							(0x47)
#define AW862XX_REG_SYSCTRL6							(0x48)
#define AW862XX_REG_SYSCTRL7							(0x49)
#define AW862XX_REG_PWMCFG1								(0x4C)
#define AW862XX_REG_PWMCFG3								(0x4E)
#define AW862XX_REG_PWMCFG4								(0x4F)
#define AW862XX_REG_DETCFG1								(0x51)
#define AW862XX_REG_DETCFG2								(0x52)
#define AW862XX_REG_DET_RL								(0x53)
#define AW862XX_REG_DET_OS								(0x54)
#define AW862XX_REG_DET_VBAT							(0x55)
#define AW862XX_REG_DET_LO								(0x57)
#define AW862XX_REG_TRIMCFG1							(0x58)
#define AW862XX_REG_TRIMCFG3							(0x5A)
#define AW862XX_REG_EFRD9								(0x64)
#define AW862XX_REG_ANACFG8								(0x77)

/********************************************
 * AW862X Register List
 *******************************************/
#define AW862X_REG_ID									(0x00)
#define AW862X_REG_SYSST								(0x01)
#define AW862X_REG_SYSINT								(0x02)
#define AW862X_REG_SYSINTM								(0x03)
#define AW862X_REG_SYSCTRL								(0x04)
#define AW862X_REG_GO									(0x05)
#define AW862X_REG_RTP_DATA								(0x06)
#define AW862X_REG_WAVSEQ1								(0x07)
#define AW862X_REG_WAVSEQ2								(0x08)
#define AW862X_REG_WAVSEQ3								(0x09)
#define AW862X_REG_WAVSEQ4								(0x0a)
#define AW862X_REG_WAVSEQ5								(0x0b)
#define AW862X_REG_WAVSEQ6								(0x0c)
#define AW862X_REG_WAVSEQ7								(0x0d)
#define AW862X_REG_WAVSEQ8								(0x0e)
#define AW862X_REG_WAVLOOP1								(0x0f)
#define AW862X_REG_WAVLOOP2								(0x10)
#define AW862X_REG_WAVLOOP3								(0x11)
#define AW862X_REG_WAVLOOP4								(0x12)
#define AW862X_REG_MANLOOP								(0x13)
#define AW862X_REG_TRG1_SEQP							(0x14)
#define AW862X_REG_TRG1_SEQN							(0x17)
#define AW862X_REG_TRG_CFG1								(0x1b)
#define AW862X_REG_TRG_CFG2								(0x1c)
#define AW862X_REG_DBGCTRL								(0x20)
#define AW862X_REG_BASE_ADDRH							(0x21)
#define AW862X_REG_BASE_ADDRL							(0x22)
#define AW862X_REG_FIFO_AEH								(0x23)
#define AW862X_REG_FIFO_AEL								(0x24)
#define AW862X_REG_FIFO_AFH								(0x25)
#define AW862X_REG_FIFO_AFL								(0x26)
#define AW862X_REG_DATCTRL								(0x2b)
#define AW862X_REG_PWMPRC								(0x2d)
#define AW862X_REG_PWMDBG								(0x2e)
#define AW862X_REG_DBGSTAT								(0x30)
#define AW862X_REG_WAVECTRL								(0x31)
#define AW862X_REG_BRAKE0_CTRL							(0x32)
#define AW862X_REG_BRAKE1_CTRL							(0x33)
#define AW862X_REG_BRAKE2_CTRL							(0x34)
#define AW862X_REG_BRAKE_NUM							(0x35)
#define AW862X_REG_ANACTRL								(0x38)
#define AW862X_REG_SW_BRAKE								(0x39)
#define AW862X_REG_DATDBG								(0x3b)
#define AW862X_REG_PRLVL								(0x3e)
#define AW862X_REG_PRTIME								(0x3f)
#define AW862X_REG_RAMADDRH								(0x40)
#define AW862X_REG_RAMADDRL								(0x41)
#define AW862X_REG_RAMDATA								(0x42)
#define AW862X_REG_BRA_MAX_NUM							(0x44)
#define AW862X_REG_GLB_STATE							(0x47)
#define AW862X_REG_CONT_CTRL							(0x48)
#define AW862X_REG_F_PRE_H								(0x49)
#define AW862X_REG_F_PRE_L								(0x4a)
#define AW862X_REG_TD_H									(0x4b)
#define AW862X_REG_TD_L									(0x4c)
#define AW862X_REG_TSET									(0x4d)
#define AW862X_REG_THRS_BRA_END							(0x4f)
#define AW862X_REG_EF_RDATAH							(0x55)
#define AW862X_REG_TRIM_LRA								(0x5b)
#define AW862X_REG_R_SPARE								(0x5d)
#define AW862X_REG_D2SCFG								(0x5e)
#define AW862X_REG_DETCTRL								(0x5f)
#define AW862X_REG_RLDET								(0x60)
#define AW862X_REG_OSDET								(0x61)
#define AW862X_REG_VBATDET								(0x62)
#define AW862X_REG_ADCTEST								(0x66)
#define AW862X_REG_F_LRA_F0_H							(0x68)
#define AW862X_REG_F_LRA_F0_L							(0x69)
#define AW862X_REG_F_LRA_CONT_H							(0x6a)
#define AW862X_REG_F_LRA_CONT_L							(0x6b)
#define AW862X_REG_WAIT_VOL_MP							(0x6e)
#define AW862X_REG_WAIT_VOL_MN							(0x6f)
#define AW862X_REG_ZC_THRSH_H							(0x72)
#define AW862X_REG_ZC_THRSH_L							(0x73)
#define AW862X_REG_BEMF_VTHH_H							(0x74)
#define AW862X_REG_BEMF_VTHH_L							(0x75)
#define AW862X_REG_BEMF_VTHL_H							(0x76)
#define AW862X_REG_BEMF_VTHL_L							(0x77)
#define AW862X_REG_BEMF_NUM								(0x78)
#define AW862X_REG_DRV_TIME								(0x79)
#define AW862X_REG_TIME_NZC								(0x7a)
#define AW862X_REG_DRV_LVL								(0x7b)
#define AW862X_REG_DRV_LVL_OV							(0x7c)
#define AW862X_REG_NUM_F0_1								(0x7d)
#define AW862X_REG_NUM_F0_2								(0x7e)
#define AW862X_REG_NUM_F0_3								(0x7f)

/********************************************
 * AW8623X Register List
 *******************************************/
#define AW8623X_REG_RSTCFG								(0x00)
#define AW8623X_REG_SYSST								(0x01)
#define AW8623X_REG_SYSINT								(0x02)
#define AW8623X_REG_SYSINTM								(0x03)
#define AW8623X_REG_SYSST2								(0x04)
#define AW8623X_REG_SYSER								(0x05)
#define AW8623X_REG_PLAYCFG2							(0x07)
#define AW8623X_REG_PLAYCFG3							(0x08)
#define AW8623X_REG_PLAYCFG4							(0x09)
#define AW8623X_REG_WAVCFG1								(0x0A)
#define AW8623X_REG_WAVCFG2								(0x0B)
#define AW8623X_REG_WAVCFG3								(0x0C)
#define AW8623X_REG_WAVCFG4								(0x0D)
#define AW8623X_REG_WAVCFG5								(0x0E)
#define AW8623X_REG_WAVCFG6								(0x0F)
#define AW8623X_REG_WAVCFG7								(0x10)
#define AW8623X_REG_WAVCFG8								(0x11)
#define AW8623X_REG_WAVCFG9								(0x12)
#define AW8623X_REG_WAVCFG10							(0x13)
#define AW8623X_REG_WAVCFG11							(0x14)
#define AW8623X_REG_WAVCFG12							(0x15)
#define AW8623X_REG_WAVCFG13							(0x16)
#define AW8623X_REG_CONTCFG1							(0x17)
#define AW8623X_REG_CONTCFG2							(0x18)
#define AW8623X_REG_CONTCFG3							(0x19)
#define AW8623X_REG_CONTCFG4							(0x1A)
#define AW8623X_REG_CONTCFG5							(0x1B)
#define AW8623X_REG_CONTCFG6							(0x1C)
#define AW8623X_REG_CONTCFG7							(0x1D)
#define AW8623X_REG_CONTCFG8							(0x1E)
#define AW8623X_REG_CONTCFG9							(0x1F)
#define AW8623X_REG_CONTCFG10							(0x20)
#define AW8623X_REG_CONTCFG11							(0x21)
#define AW8623X_REG_CONTCFG12							(0x22)
#define AW8623X_REG_CONTCFG13							(0x23)
#define AW8623X_REG_CONTRD14							(0x24)
#define AW8623X_REG_CONTRD15							(0x25)
#define AW8623X_REG_CONTRD16							(0x26)
#define AW8623X_REG_CONTRD17							(0x27)
#define AW8623X_REG_CONTRD18							(0x28)
#define AW8623X_REG_CONTRD19							(0x29)
#define AW8623X_REG_CONTRD20							(0x2A)
#define AW8623X_REG_CONTRD21							(0x2B)
#define AW8623X_REG_RTPCFG1								(0x2C)
#define AW8623X_REG_RTPCFG2								(0x2D)
#define AW8623X_REG_RTPCFG3								(0x2E)
#define AW8623X_REG_RTPCFG4								(0x2F)
#define AW8623X_REG_RTPCFG5								(0x30)
#define AW8623X_REG_RTPCFG6								(0x31)
#define AW8623X_REG_RTPDATA								(0x32)
#define AW8623X_REG_TRGCFG1								(0x33)
#define AW8623X_REG_TRGCFG2								(0x34)
#define AW8623X_REG_TRGCFG3								(0x35)
#define AW8623X_REG_TRGCFG4								(0x36)
#define AW8623X_REG_TRGCFG5								(0x37)
#define AW8623X_REG_TRGCFG6								(0x38)
#define AW8623X_REG_TRGCFG7								(0x39)
#define AW8623X_REG_TRGCFG8								(0x3A)
#define AW8623X_REG_GLBCFG2								(0x3C)
#define AW8623X_REG_GLBCFG4								(0x3E)
#define AW8623X_REG_GLBRD5								(0x3F)
#define AW8623X_REG_RAMADDRH							(0x40)
#define AW8623X_REG_RAMADDRL							(0x41)
#define AW8623X_REG_RAMDATA								(0x42)
#define AW8623X_REG_TRGCFG9								(0x43)
#define AW8623X_REG_I2SCFG1								(0x44)
#define AW8623X_REG_SYSCTRL1							(0x45)
#define AW8623X_REG_SYSCTRL2							(0x46)
#define AW8623X_REG_SYSCTRL3							(0x47)
#define AW8623X_REG_SYSCTRL4							(0x48)
#define AW8623X_REG_SYSCTRL5							(0x49)
#define AW8623X_REG_PWMCFG1								(0x4A)
#define AW8623X_REG_PWMCFG3								(0x4C)
#define AW8623X_REG_PWMCFG4								(0x4D)
#define AW8623X_REG_VBATCTRL							(0x4E)
#define AW8623X_REG_DETCFG1								(0x4F)
#define AW8623X_REG_DETCFG2								(0x50)
#define AW8623X_REG_DETRD1								(0x51)
#define AW8623X_REG_DETRD2								(0x52)
#define AW8623X_REG_DETRD3								(0x53)
#define AW8623X_REG_IDH									(0x57)
#define AW8623X_REG_IDL									(0x58)
#define AW8623X_REG_TRIMCFG1							(0x59)
#define AW8623X_REG_TRIMCFG2							(0x5A)
#define AW8623X_REG_TRIMCFG3							(0x5B)
#define AW8623X_REG_AUTOSIN1							(0x5C)
#define AW8623X_REG_AUTOSIN2							(0x5D)
#define AW8623X_REG_TRIMCFG5							(0x5E)
#define AW8623X_REG_EFCFG6								(0x64)
#define AW8623X_REG_CHIPIDL								(0x69)
#define AW8623X_REG_EFCFG12								(0x6A)
#define AW8623X_REG_ANACFG3								(0x70)
#define AW8623X_REG_ANACFG4								(0x71)
#define AW8623X_REG_ANACFG5								(0x72)
#define AW8623X_REG_ANACFG10							(0x77)
/********************************************
 * AW8624X Register List
 *******************************************/
#define AW8624X_REG_ID									(0x00)
#define AW8624X_REG_SYSST								(0x01)
#define AW8624X_REG_SYSINT								(0x02)
#define AW8624X_REG_SYSINTM								(0x03)
#define AW8624X_REG_SYSST2								(0x04)
#define AW8624X_REG_SYSER								(0x05)
#define AW8624X_REG_PLAYCFG2							(0x07)
#define AW8624X_REG_PLAYCFG3							(0x08)
#define AW8624X_REG_PLAYCFG4							(0x09)
#define AW8624X_REG_WAVCFG1								(0x0A)
#define AW8624X_REG_WAVCFG2								(0x0B)
#define AW8624X_REG_WAVCFG3								(0x0C)
#define AW8624X_REG_WAVCFG4								(0x0D)
#define AW8624X_REG_WAVCFG5								(0x0E)
#define AW8624X_REG_WAVCFG6								(0x0F)
#define AW8624X_REG_WAVCFG7								(0x10)
#define AW8624X_REG_WAVCFG8								(0x11)
#define AW8624X_REG_WAVCFG9								(0x12)
#define AW8624X_REG_WAVCFG10							(0x13)
#define AW8624X_REG_WAVCFG11							(0x14)
#define AW8624X_REG_WAVCFG12							(0x15)
#define AW8624X_REG_WAVCFG13							(0x16)
#define AW8624X_REG_CONTCFG1							(0x18)
#define AW8624X_REG_CONTCFG2							(0x19)
#define AW8624X_REG_CONTCFG3							(0x1A)
#define AW8624X_REG_CONTCFG4							(0x1B)
#define AW8624X_REG_CONTCFG5							(0x1C)
#define AW8624X_REG_CONTCFG6							(0x1D)
#define AW8624X_REG_CONTCFG7							(0x1E)
#define AW8624X_REG_CONTCFG8							(0x1F)
#define AW8624X_REG_CONTCFG9							(0x20)
#define AW8624X_REG_CONTCFG10							(0x21)
#define AW8624X_REG_CONTCFG11							(0x22)
#define AW8624X_REG_CONTCFG12							(0x23)
#define AW8624X_REG_CONTCFG13							(0x24)
#define AW8624X_REG_CONTRD14							(0x25)
#define AW8624X_REG_CONTRD15							(0x26)
#define AW8624X_REG_CONTRD16							(0x27)
#define AW8624X_REG_CONTRD17							(0x28)
#define AW8624X_REG_CONTRD18							(0x29)
#define AW8624X_REG_CONTRD19							(0x2A)
#define AW8624X_REG_CONTRD20							(0x2B)
#define AW8624X_REG_CONTRD21							(0x2C)
#define AW8624X_REG_RTPCFG1								(0x2D)
#define AW8624X_REG_RTPCFG2								(0x2E)
#define AW8624X_REG_RTPCFG3								(0x2F)
#define AW8624X_REG_RTPCFG4								(0x30)
#define AW8624X_REG_RTPCFG5								(0x31)
#define AW8624X_REG_RTPDATA								(0x32)
#define AW8624X_REG_TRGCFG1								(0x33)
#define AW8624X_REG_TRGCFG2								(0x34)
#define AW8624X_REG_TRGCFG3								(0x35)
#define AW8624X_REG_TRGCFG4								(0x36)
#define AW8624X_REG_TRGCFG5								(0x37)
#define AW8624X_REG_TRGCFG6								(0x38)
#define AW8624X_REG_TRGCFG7								(0x39)
#define AW8624X_REG_TRGCFG8								(0x3A)
#define AW8624X_REG_GLBCFG2								(0x3C)
#define AW8624X_REG_GLBCFG4								(0x3E)
#define AW8624X_REG_GLBRD5								(0x3F)
#define AW8624X_REG_RAMADDRH							(0x40)
#define AW8624X_REG_RAMADDRL							(0x41)
#define AW8624X_REG_RAMDATA								(0x42)
#define AW8624X_REG_SYSCTRL1							(0x43)
#define AW8624X_REG_SYSCTRL2							(0x44)
#define AW8624X_REG_SYSCTRL3							(0x45)
#define AW8624X_REG_SYSCTRL4							(0x46)
#define AW8624X_REG_SYSCTRL5							(0x49)
#define AW8624X_REG_SYSCTRL6							(0x4A)
#define AW8624X_REG_PWMCFG1								(0x4C)
#define AW8624X_REG_PWMCFG3								(0x4E)
#define AW8624X_REG_PWMCFG4								(0x4F)
#define AW8624X_REG_DET_LO								(0x50)
#define AW8624X_REG_DETCFG1								(0x51)
#define AW8624X_REG_DETCFG2								(0x52)
#define AW8624X_REG_DET_RL								(0x53)
#define AW8624X_REG_DET_OS								(0x54)
#define AW8624X_REG_DET_VBAT							(0x55)
#define AW8624X_REG_CHIPIDH								(0x57)
#define AW8624X_REG_CHIPIDL								(0x58)
#define AW8624X_REG_TRIMCFG1							(0x59)
#define AW8624X_REG_TRIMCFG3							(0x5A)
#define AW8624X_REG_EFRD9								(0x64)
#define AW8624X_REG_ANACFG8								(0x77)
/******************************************************
 * Common Register Detail
 *****************************************************/
#define AW_BIT_RESET									(0xAA)
/* GLB_STATE */
#define AW_BIT_GLBRD_STATE_MASK							(15<<0)
#define AW_BIT_STATE_STANDBY							(0<<0)
#define AW_BIT_STATE_WAKEUP								(1<<0)
#define AW_BIT_STATE_STARTUP							(2<<0)
#define AW_BIT_STATE_WAIT								(3<<0)
#define AW_BIT_STATE_CONT_GO							(6<<0)
#define AW_BIT_STATE_RAM_GO								(7<<0)
#define AW_BIT_STATE_RTP_GO								(8<<0)
#define AW_BIT_STATE_TRIG_GO							(9<<0)
#define AW_BIT_STATE_BRAKE								(11<<0)
#define AW_BIT_STATE_END								(12<<0)
/******************************************************
 * AW862XX Register Detail
 *****************************************************/
/* SYSST: reg 0x01 RO */
#define AW862XX_BIT_SYSST_UVLS							(1<<5)
#define AW862XX_BIT_SYSST_FF_AES						(1<<4)
#define AW862XX_BIT_SYSST_FF_AFS						(1<<3)
#define AW862XX_BIT_SYSST_OCDS							(1<<2)
#define AW862XX_BIT_SYSST_OTS							(1<<1)
#define AW862XX_BIT_SYSST_DONES							(1<<0)

/* SYSINT: reg 0x02 RC */
#define AW862XX_BIT_SYSINT_UVLI							(1<<5)
#define AW862XX_BIT_SYSINT_FF_AEI						(1<<4)
#define AW862XX_BIT_SYSINT_FF_AFI						(1<<3)
#define AW862XX_BIT_SYSINT_OCDI							(1<<2)
#define AW862XX_BIT_SYSINT_OTI							(1<<1)
#define AW862XX_BIT_SYSINT_DONEI						(1<<0)

