Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/* SYSINTM: reg 0x03 RW */
#define AW862XX_BIT_SYSINTM_UVLM_MASK					(~(1<<5))
#define AW862XX_BIT_SYSINTM_UVLM_OFF					(1<<5)
#define AW862XX_BIT_SYSINTM_UVLM_ON						(0<<5)
#define AW862XX_BIT_SYSINTM_FF_AEM_MASK					(~(1<<4))
#define AW862XX_BIT_SYSINTM_FF_AEM_OFF					(1<<4)
#define AW862XX_BIT_SYSINTM_FF_AEM_ON					(0<<4)
#define AW862XX_BIT_SYSINTM_FF_AFM_MASK					(~(1<<3))
#define AW862XX_BIT_SYSINTM_FF_AFM_OFF					(1<<3)
#define AW862XX_BIT_SYSINTM_FF_AFM_ON					(0<<3)
#define AW862XX_BIT_SYSINTM_OCDM_MASK					(~(1<<2))
#define AW862XX_BIT_SYSINTM_OCDM_OFF					(1<<2)
#define AW862XX_BIT_SYSINTM_OCDM_ON						(0<<2)
#define AW862XX_BIT_SYSINTM_OTM_MASK					(~(1<<1))
#define AW862XX_BIT_SYSINTM_OTM_OFF						(1<<1)
#define AW862XX_BIT_SYSINTM_OTM_ON						(0<<1)
#define AW862XX_BIT_SYSINTM_DONEM_MASK					(~(1<<0))
#define AW862XX_BIT_SYSINTM_DONEM_OFF					(1<<0)
#define AW862XX_BIT_SYSINTM_DONEM_ON					(0<<0)

/* SYSST2: reg 0x04 RO */
#define AW862XX_BIT_SYSST2_RAM_ADDR_ER					(1<<7)
#define AW862XX_BIT_SYSST2_TRG_ADDR_ER					(1<<6)
#define AW862XX_BIT_SYSST2_VBG_OK						(1<<3)
#define AW862XX_BIT_SYSST2_LDO_OK						(1<<2)
#define AW862XX_BIT_SYSST2_FF_FULL						(1<<1)
#define AW862XX_BIT_SYSST2_FF_EMPTY						(1<<0)

/* SYSER: reg 0x05 RC */
#define AW862XX_BIT_SYSER_I2S_ERR						(1<<7)
#define AW862XX_BIT_SYSER_TRIG1_EVENT					(1<<6)
#define AW862XX_BIT_SYSER_TRIG2_EVENT					(1<<5)
#define AW862XX_BIT_SYSER_TRIG3_EVENT					(1<<4)
#define AW862XX_BIT_SYSER_OV							(1<<3)
#define AW862XX_BIT_SYSER_ADDR_ER						(1<<2)
#define AW862XX_BIT_SYSER_FF_ER							(1<<1)
#define AW862XX_BIT_SYSER_PLL_REF_ER					(1<<0)

/* PLAYCFG3: reg 0x08 RW */
#define AW862XX_BIT_PLAYCFG3_STOP_MODE_MASK				(~(1<<5))
#define AW862XX_BIT_PLAYCFG3_STOP_MODE_NOW				(1<<5)
#define AW862XX_BIT_PLAYCFG3_STOP_MODE_LATER			(0<<5)
#define AW862XX_BIT_PLAYCFG3_BRK_EN_MASK				(~(1<<2))
#define AW862XX_BIT_PLAYCFG3_BRK						(1<<2)
#define AW862XX_BIT_PLAYCFG3_BRK_ENABLE					(1<<2)
#define AW862XX_BIT_PLAYCFG3_BRK_DISABLE				(0<<2)
#define AW862XX_BIT_PLAYCFG3_PLAY_MODE_MASK				(~(3<<0))
#define AW862XX_BIT_PLAYCFG3_PLAY_MODE_STOP				(3<<0)
#define AW862XX_BIT_PLAYCFG3_PLAY_MODE_CONT				(2<<0)
#define AW862XX_BIT_PLAYCFG3_PLAY_MODE_RTP				(1<<0)
#define AW862XX_BIT_PLAYCFG3_PLAY_MODE_RAM				(0<<0)

/* PLAYCFG4: reg 0x09 RW */
#define AW862XX_BIT_PLAYCFG4_STOP_MASK					(~(1<<1))
#define AW862XX_BIT_PLAYCFG4_STOP_ON					(1<<1)
#define AW862XX_BIT_PLAYCFG4_STOP_OFF					(0<<1)
#define AW862XX_BIT_PLAYCFG4_GO_MASK					(~(1<<0))
#define AW862XX_BIT_PLAYCFG4_GO_ON						(1<<0)
#define AW862XX_BIT_PLAYCFG4_GO_OFF						(0<<0)

/* WAVCFG1-8: reg 0x0A - reg 0x11 RW */
#define AW862XX_BIT_WAVCFG_SEQWAIT_MASK					(~(1<<7))
#define AW862XX_BIT_WAVCFG_SEQWAIT_TIME					(1<<7)
#define AW862XX_BIT_WAVCFG_SEQWAIT_NUMBER				(0<<7)
#define AW862XX_BIT_WAVCFG_SEQ							(0x7F)

/* WAVCFG9-12: reg 0x12 - reg 0x15 RW */
#define AW862XX_BIT_WAVLOOP_SEQ_ODD_MASK				(~(0x0F<<4))
#define AW862XX_BIT_WAVLOOP_SEQ_ODD_INIFINITELY				(0x0F<<4)
#define AW862XX_BIT_WAVLOOP_SEQ_EVEN_MASK				(~(0x0F<<0))
#define AW862XX_BIT_WAVLOOP_SEQ_EVEN_INIFINITELY			(0x0F<<0)
#define AW862XX_BIT_WAVLOOP_INIFINITELY					(0x0F<<0)

/* WAVCFG9: reg 0x12 RW */
#define AW862XX_BIT_WAVCFG9_SEQ1LOOP_MASK				(~(0x0F<<4))
#define AW862XX_BIT_WAVCFG9_SEQ1LOOP_INIFINITELY			(0x0F<<4)
#define AW862XX_BIT_WAVCFG9_SEQ2LOOP_MASK				(~(0x0F<<0))
#define AW862XX_BIT_WAVCFG9_SEQ2LOOP_INIFINITELY			(0x0F<<0)

/* WAVCFG10: reg 0x13 RW */
#define AW862XX_BIT_WAVCFG10_SEQ3LOOP_MASK				(~(0x0F<<4))
#define AW862XX_BIT_WAVCFG10_SEQ3LOOP_INIFINITELY		(0x0F<<4)
#define AW862XX_BIT_WAVCFG10_SEQ4LOOP_MASK				(~(0x0F<<0))
#define AW862XX_BIT_WAVCFG10_SEQ4LOOP_INIFINITELY		(0x0F<<0)

/* WAVCFG11: reg 0x14 RW */
#define AW862XX_BIT_WAVCFG11_SEQ5LOOP_MASK				(~(0x0F<<4))
#define AW862XX_BIT_WAVCFG11_SEQ5LOOP_INIFINITELY		(0x0F<<4)
#define AW862XX_BIT_WAVCFG11_SEQ6LOOP_MASK				(~(0x0F<<0))
#define AW862XX_BIT_WAVCFG11_SEQ6LOOP_INIFINITELY		(0x0F<<0)

/* WAVCFG12: reg 0x15 RW */
#define AW862XX_BIT_WAVCFG12_SEQ7LOOP_MASK				(~(0x0F<<4))
#define AW862XX_BIT_WAVCFG12_SEQ7LOOP_INIFINITELY		(0x0F<<4)
#define AW862XX_BIT_WAVCFG12_SEQ8LOOP_MASK				(~(0x0F<<0))
#define AW862XX_BIT_WAVCFG12_SEQ8LOOP_INIFINITELY		(0x0F<<0)

/***************** CONT *****************/
/* CONTCFG1: reg 0x18 RW */
#define AW862XX_BIT_CONTCFG1_EDGE_FRE_MASK				(~(0x0F<<4))
#define AW862XX_BIT_CONTCFG1_EN_F0_DET_MASK				(~(1<<3))
#define AW862XX_BIT_CONTCFG1_F0_DET_ENABLE				(1<<3)
#define AW862XX_BIT_CONTCFG1_F0_DET_DISABLE				(0<<3)
#define AW862XX_BIT_CONTCFG1_SIN_MODE_MASK				(~(1<<0))
#define AW862XX_BIT_CONTCFG1_SIN_MODE_COS				(1<<0)
#define AW862XX_BIT_CONTCFG1_SIN_MODE_SINE				(0<<0)
/* CONTCFG3: reg 0x1A RW */

/* CONTCFG5: reg 0x1C RW */
#define AW862XX_BIT_CONTCFG5_BRK_GAIN_MASK				(~(0x0F<<0))

/* CONTCFG6: reg 0x1D RW */
#define AW862XX_BIT_CONTCFG6_TRACK_EN_MASK				(~(1<<7))
#define AW862XX_BIT_CONTCFG6_TRACK_ENABLE				(1<<7)
#define AW862XX_BIT_CONTCFG6_TRACK_DISABLE				(0<<7)
#define AW862XX_BIT_CONTCFG6_DRV1_LVL_MASK				(~(0x7F<<0))

/* CONTCFG7: reg 0x1E RW */
#define AW862XX_BIT_CONTCFG7_DRV2_LVL_MASK				(~(0x7F<<0))

/* CONTCFG13: reg 0x24 RW */
#define AW862XX_BIT_CONTCFG13_TSET_MASK					(~(0x0F<<4))
#define AW862XX_BIT_CONTCFG13_BEME_SET_MASK				(~(0x0F<<0))

/***************** RTP *****************/
/* RTPCFG1: reg 0x2D RW */
#define AW862XX_BIT_RTPCFG1_ADDRH_MASK					(~(0x0F<<0))
#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_2K_MASK			(~(1<<5))
#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_2K_EN				(1<<5)
#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_2K_DIS			(0<<5)

#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_1K_MASK			(~(1<<4))
#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_1K_EN				(1<<4)
#define AW862XX_BIT_RTPCFG1_SRAM_SIZE_1K_DIS			(0<<4)

/* RTPCFG3: reg 0x2F RW */
#define AW862XX_BIT_RTPCFG3_FIFO_AEH_MASK				(~(0x0F<<4))
#define AW862XX_BIT_RTPCFG3_FIFO_AFH_MASK				(~(0x0F<<0))
#define AW862XX_BIT_RTPCFG3_FIFO_AEH					(0x0F<<4)
#define AW862XX_BIT_RTPCFG3_FIFO_AFH					(0x0F<<0)

