Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/***************** TRIGGER *****************/
#define AW862XX_BIT_TRG_ENABLE_MASK						(~(1<<7))
#define AW862XX_BIT_TRG_ENABLE							(1<<7)
#define AW862XX_BIT_TRG_DISABLE							(0<<7)
#define AW862XX_BIT_TRG_SEQ_MASK						(~(0x7F<<0))

/* TRGCFG1: reg 0x33 RW */
#define AW862XX_BIT_TRGCFG1_TRG1_POS_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG1_TRG1_POS_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG1_TRG1_POS_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG1_TRG1SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG2: reg 0x34 RW */
#define AW862XX_BIT_TRGCFG2_TRG2_POS_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG2_TRG2_POS_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG2_TRG2_POS_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG2_TRG2SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG3: reg 0x35 RW */
#define AW862XX_BIT_TRGCFG3_TRG3_POS_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG3_TRG3_POS_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG3_TRG3_POS_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG3_TRG3SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG4: reg 0x36 RW */
#define AW862XX_BIT_TRGCFG4_TRG1_NEG_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG4_TRG1_NEG_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG4_TRG1_NEG_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG4_TRG1SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG5: reg 0x37 RW */
#define AW862XX_BIT_TRGCFG5_TRG2_NEG_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG5_TRG2_NEG_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG5_TRG2_NEG_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG5_TRG2SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG6: reg 0x38 RW */
#define AW862XX_BIT_TRGCFG6_TRG3_NEG_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG6_TRG3_NEG_ENABLE				(1<<7)
#define AW862XX_BIT_TRGCFG6_TRG3_NEG_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG6_TRG3SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG7: reg 0x39 RW */
#define AW862XX_BIT_TRGCFG7_TRG1_POR_LEV_BRK_MASK		(~(7<<5))
#define AW862XX_BIT_TRGCFG7_TRG2_POR_LEV_BRK_MASK		(~(7<<1))
#define AW862XX_BIT_TRGCFG7_TRG1_POLAR_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG7_TRG1_POLAR_NEG				(1<<7)
#define AW862XX_BIT_TRGCFG7_TRG1_POLAR_POS				(0<<7)
#define AW862XX_BIT_TRGCFG7_TRG1_MODE_MASK				(~(1<<6))
#define AW862XX_BIT_TRGCFG7_TRG1_MODE_LEVEL				(1<<6)
#define AW862XX_BIT_TRGCFG7_TRG1_MODE_EDGE				(0<<6)
#define AW862XX_BIT_TRGCFG7_TRG1_AUTO_BRK_MASK			(~(1<<5))
#define AW862XX_BIT_TRGCFG7_TRG1_AUTO_BRK_ENABLE		(1<<5)
#define AW862XX_BIT_TRGCFG7_TRG1_AUTO_BRK_DISABLE		(0<<5)
#define AW862XX_BIT_TRGCFG7_TRG2_POLAR_MASK				(~(1<<3))
#define AW862XX_BIT_TRGCFG7_TRG2_POLAR_NEG				(1<<3)
#define AW862XX_BIT_TRGCFG7_TRG2_POLAR_POS				(0<<3)
#define AW862XX_BIT_TRGCFG7_TRG2_MODE_MASK				(~(1<<2))
#define AW862XX_BIT_TRGCFG7_TRG2_MODE_LEVEL				(1<<2)
#define AW862XX_BIT_TRGCFG7_TRG2_MODE_EDGE				(0<<2)
#define AW862XX_BIT_TRGCFG7_TRG2_AUTO_BRK_MASK			(~(1<<1))
#define AW862XX_BIT_TRGCFG7_TRG2_AUTO_BRK_ENABLE		(1<<1)
#define AW862XX_BIT_TRGCFG7_TRG2_AUTO_BRK_DISABLE		(0<<1)

/* TRGCFG8: reg 0x3A RW */
#define AW862XX_BIT_TRGCFG8_TRG3_POR_LEV_BRK_MASK		(~(7<<5))
#define AW862XX_BIT_TRGCFG8_TRG3_POLAR_MASK				(~(1<<7))
#define AW862XX_BIT_TRGCFG8_TRG3_POLAR_NEG				(1<<7)
#define AW862XX_BIT_TRGCFG8_TRG3_POLAR_POS				(0<<7)
#define AW862XX_BIT_TRGCFG8_TRG3_MODE_MASK				(~(1<<6))
#define AW862XX_BIT_TRGCFG8_TRG3_MODE_LEVEL				(1<<6)
#define AW862XX_BIT_TRGCFG8_TRG3_MODE_EDGE				(0<<6)
#define AW862XX_BIT_TRGCFG8_TRG3_AUTO_BRK_MASK			(~(1<<5))
#define AW862XX_BIT_TRGCFG8_TRG3_AUTO_BRK_ENABLE		(1<<5)
#define AW862XX_BIT_TRGCFG8_TRG3_AUTO_BRK_DISABLE		(0<<5)
#define AW862XX_BIT_TRGCFG8_TRG_TRIG1_MODE_MASK			(~(3<<3))
#define AW862XX_BIT_TRGCFG8_PWM_LRA						(0<<3)
#define AW862XX_BIT_TRGCFG8_PWM_ERA						(1<<3)
#define AW862XX_BIT_TRGCFG8_TRIG1						(2<<3)
#define AW862XX_BIT_TRGCFG8_DISABLE						(3<<3)
#define AW862XX_BIT_TRGCFG8_TRG1_STOP_MASK				(~(1<<2))
#define AW862XX_BIT_TRGCFG8_TRG1_STOP					(1<<2)
#define AW862XX_BIT_TRGCFG8_TRG2_STOP_MASK				(~(1<<1))
#define AW862XX_BIT_TRGCFG8_TRG2_STOP					(1<<1)
#define AW862XX_BIT_TRGCFG8_TRG3_STOP_MASK				(~(1<<0))
#define AW862XX_BIT_TRGCFG8_TRG3_STOP					(1<<0)

/* GLBCFG2: reg 0x3C RW */
/* START_DLY */
#define AW862XX_BIT_GLBCFG2_START_DLY_250US				(0x0C)

/* GLBCFG4: reg 0x3E RW */
#define AW862XX_BIT_GLBCFG4_GO_PRIO_MASK				(~(3<<6))
#define AW862XX_BIT_GLBCFG4_TRG3_PRIO_MASK				(~(3<<4))
#define AW862XX_BIT_GLBCFG4_TRG2_PRIO_MASK				(~(3<<2))
#define AW862XX_BIT_GLBCFG4_TRG1_PRIO_MASK				(~(3<<0))

/* GLBRD5: reg 0x3F R0 */
/* GLB_STATE */
#define AW862XX_BIT_GLBRD5_STATE						(15<<0)
#define AW862XX_BIT_GLBRD5_STATE_STANDBY				(0<<0)
#define AW862XX_BIT_GLBRD5_STATE_WAKEUP					(1<<0)
#define AW862XX_BIT_GLBRD5_STATE_STARTUP				(2<<0)
#define AW862XX_BIT_GLBRD5_STATE_WAIT					(3<<0)
#define AW862XX_BIT_GLBRD5_STATE_CONT_GO				(6<<0)
#define AW862XX_BIT_GLBRD5_STATE_RAM_GO					(7<<0)
#define AW862XX_BIT_GLBRD5_STATE_RTP_GO					(8<<0)
#define AW862XX_BIT_GLBRD5_STATE_TRIG_GO				(9<<0)
#define AW862XX_BIT_GLBRD5_STATE_I2S_GO					(10<<0)
#define AW862XX_BIT_GLBRD5_STATE_BRAKE					(11<<0)
#define AW862XX_BIT_GLBRD5_STATE_END					(12<<0)
/* RAMADDRH: reg 0x40 RWS */
#define AW862XX_BIT_RAMADDRH_MASK						(~(63<<0))

/***************** SYSCTRL *****************/
/* SYSCTRL1: reg 0x43 RW */
#define AW862XX_BIT_SYSCTRL1_VBAT_MODE_MASK				(~(1<<7))
#define AW862XX_BIT_SYSCTRL1_VBAT_MODE_HW				(1<<7)
#define AW862XX_BIT_SYSCTRL1_VBAT_MODE_SW				(0<<7)
#define AW862XX_BIT_SYSCTRL1_PERP_MASK					(~(1<<6))
#define AW862XX_BIT_SYSCTRL1_PERP_ON					(1<<6)
#define AW862XX_BIT_SYSCTRL1_PERP_OFF					(0<<6)
#define AW862XX_BIT_SYSCTRL1_CLK_SEL_MASK				(~(3<<4))
#define AW862XX_BIT_SYSCTRL1_CLK_SEL_OSC				(1<<4)
#define AW862XX_BIT_SYSCTRL1_CLK_SEL_AUTO				(0<<4)
#define AW862XX_BIT_SYSCTRL1_RAMINIT_MASK				(~(1<<3))
#define AW862XX_BIT_SYSCTRL1_RAMINIT_ON					(1<<3)
#define AW862XX_BIT_SYSCTRL1_RAMINIT_OFF				(0<<3)
#define AW862XX_BIT_SYSCTRL1_EN_FIR_MASK				(~(1<<2))
#define AW862XX_BIT_SYSCTRL1_FIR_ENABLE					(0<<2)
#define AW862XX_BIT_SYSCTRL1_WAKE_MODE_MASK				(~(1<<1))
#define AW862XX_BIT_SYSCTRL1_WAKE_MODE_WAKEUP			(1<<1)
#define AW862XX_BIT_SYSCTRL1_WAKE_MODE_BST				(0<<1)
#define AW862XX_BIT_SYSCTRL1_RTP_CLK_MASK				(~(1<<0))
#define AW862XX_BIT_SYSCTRL1_RTP_PLL					(1<<0)
#define AW862XX_BIT_SYSCTRL1_RTP_OSC					(0<<0)

/* SYSCTRL2: reg 0x44 RW */
#define AW862XX_BIT_SYSCTRL2_WAKE_MASK					(~(1<<7))
#define AW862XX_BIT_SYSCTRL2_WAKE_ON					(1<<7)
#define AW862XX_BIT_SYSCTRL2_WAKE_OFF					(0<<7)
#define AW862XX_BIT_SYSCTRL2_STANDBY_MASK				(~(1<<6))
#define AW862XX_BIT_SYSCTRL2_STANDBY_ON					(1<<6)
#define AW862XX_BIT_SYSCTRL2_STANDBY_OFF				(0<<6)
#define AW862XX_BIT_SYSCTRL2_RTP_DLY_MASK				(~(3<<4))
#define AW862XX_BIT_SYSCTRL2_INTN_PIN_MASK				(~(1<<3))
#define AW862XX_BIT_SYSCTRL2_INTN						(1<<3)
#define AW862XX_BIT_SYSCTRL2_TRIG1						(0<<3)
#define AW862XX_BIT_SYSCTRL2_WCK_PIN_MASK				(~(1<<2))
#define AW862XX_BIT_SYSCTRL2_ENABLE_TRIG2				(1<<2)
#define AW862XX_BIT_SYSCTRL2_DISENABLE_TRIG2			(0<<2)
#define AW862XX_BIT_SYSCTRL2_WAVDAT_MODE_MASK			(~(3<<0))
#define AW862XX_BIT_SYSCTRL2_RATE						(3<<0)
#define AW862XX_BIT_SYSCTRL2_RATE_12K					(2<<0)
#define AW862XX_BIT_SYSCTRL2_RATE_24K					(0<<0)
#define AW862XX_BIT_SYSCTRL2_RATE_48K					(1<<0)

/* SYSCTRL7: reg 0x49 RW */
#define AW862XX_BIT_SYSCTRL7_GAIN_BYPASS_MASK			(~(1<<6))
#define AW862XX_BIT_SYSCTRL7_GAIN_CHANGEABLE			(1<<6)
#define AW862XX_BIT_SYSCTRL7_GAIN_FIXED					(0<<6)
#define AW862XX_BIT_SYSCTRL7_GAIN						(0x07)

