Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
#define AW862XX_BIT_SYSCTRL7_INT_EDGE_MODE_MASK			(~(1<<5))
#define AW862XX_BIT_SYSCTRL7_INT_EDGE_MODE_POS			(0<<5)
#define AW862XX_BIT_SYSCTRL7_INT_EDGE_MODE_BOTH			(1<<5)
#define AW862XX_BIT_SYSCTRL7_INT_MODE_MASK				(~(1<<4))
#define AW862XX_BIT_SYSCTRL7_INT_MODE_EDGE				(1<<4)
#define AW862XX_BIT_SYSCTRL7_INT_MODE_LEVEL				(0<<4)

#define AW862XX_BIT_SYSCTRL7_INTP_MASK					(~(1<<3))
#define AW862XX_BIT_SYSCTRL7_INTP_HIGH					(1<<3)
#define AW862XX_BIT_SYSCTRL7_INTP_LOW					(0<<3)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_MASK				(~(7<<0))
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_1					(0<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_2					(1<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_4					(2<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_5					(3<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_8					(4<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_10				(5<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_20				(6<<0)
#define AW862XX_BIT_SYSCTRL7_D2S_GAIN_40				(7<<0)

/* PWMCFG1: reg 0x4C RW */
#define AW862XX_BIT_PWMCFG1_PRC_EN_MASK					(~(1<<7))
#define AW862XX_BIT_PWMCFG1_PRC_ENABLE					(1<<7)
#define AW862XX_BIT_PWMCFG1_PRC_DISABLE					(0<<7)
#define AW862XX_BIT_PWMCFG1_PRCTIME_MASK				(~(0x7F<<0))
#define AW862XX_BIT_PWMCFG3_PRLVL_DEFAULT_VALUE			(0x3F)

/* PWMCFG4: reg 0x4F RW */
/* PRTIME */
#define AW862XX_PWMCFG4_PRTIME_DEFAULT_VALUE			(0x32)

/* PWMCFG2: reg 0x4D RW */
#define AW862XX_BIT_PWMCFG2_REF_SEL_MASK				(~(1<<5))
#define AW862XX_BIT_PWMCFG2_REF_SEL_TRIANGLE			(1<<5)
#define AW862XX_BIT_PWMCFG2_REF_SEL_SAWTOOTH			(0<<5)
#define AW862XX_BIT_PWMCFG2_PD_HWM_MASK					(~(1<<4))
#define AW862XX_BIT_PWMCFG2_PD_HWM_ON					(1<<4)
#define AW862XX_BIT_PWMCFG2_PWMOE_MASK					(~(1<<3))
#define AW862XX_BIT_PWMCFG2_PWMOE_ON					(1<<3)
#define AW862XX_BIT_PWMCFG2_PWMFRC_MASK					(~(7<<0))

/* PWMCFG3: reg 0x4E RW */
#define AW862XX_BIT_PWMCFG3_PR_EN_MASK					(~(1<<7))
#define AW862XX_BIT_PWMCFG3_PR_ENABLE					(1<<7)
#define AW862XX_BIT_PWMCFG3_PR_DISABLE					(0<<7)
#define AW862XX_BIT_PWMCFG3_PRLVL_MASK					(~(0x7F<<0))

/* DETCFG1: reg 0x51 RW */
#define AW862XX_BIT_DETCFG1_FTS_GO_MASK					(~(1<<7))
#define AW862XX_BIT_DETCFG1_FTS_GO_ENABLE				(1<<7)
#define AW862XX_BIT_DETCFG1_TEST_GO_MASK				(~(1<<6))
#define AW862XX_BIT_DETCFG1_TEST_GO_ENABLE				(1<<6)
#define AW862XX_BIT_DETCFG1_ADO_SLOT_MODE_MASK			(~(1<<5))
#define AW862XX_BIT_DETCFG1_ADO_SLOT_ADC_32				(1<<5)
#define AW862XX_BIT_DETCFG1_ADO_SLOT_ADC_256			(0<<5)
#define AW862XX_BIT_DETCFG1_RL_OS_MASK					(~(1<<4))
#define AW862XX_BIT_DETCFG1_RL							(1<<4)
#define AW862XX_BIT_DETCFG1_OS							(0<<4)
#define AW862XX_BIT_DETCFG1_PRCT_MODE_MASK				(~(1<<3))
#define AW862XX_BIT_DETCFG1_PRCT_MODE_INVALID			(1<<3)
#define AW862XX_BIT_DETCFG1_PRCT_MODE_VALID				(0<<3)
#define AW862XX_BIT_DETCFG1_CLK_ADC_MASK				(~(7<<0))
#define AW862XX_BIT_DETCFG1_CLK_ADC_12M					(0<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_6M					(1<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_3M					(2<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_1M5					(3<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_M75					(4<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_M37					(5<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_M18					(6<<0)
#define AW862XX_BIT_DETCFG1_CLK_ADC_M09					(7<<0)

/* DETCFG2: reg 0x52 RW */
#define AW862XX_BIT_DETCFG2_VBAT_GO_MASK				(~(1<<1))
#define AW862XX_BIT_DETCFG2_VABT_GO_ON					(1<<1)
#define AW862XX_BIT_DETCFG2_DIAG_GO_MASK				(~(1<<0))
#define AW862XX_BIT_DETCFG2_DIAG_GO_ON					(1<<0)

/* DET_LO: reg 0x57 RW */
#define AW862XX_BIT_DET_LO_TEST_MASK					(~(3<<6))
#define AW862XX_BIT_DET_LO_VBAT_MASK					(~(3<<4))
#define AW862XX_BIT_DET_LO_VBAT							(3<<4)
#define AW862XX_BIT_DET_LO_OS_MASK						(~(3<<2))
#define AW862XX_BIT_DET_LO_RL_MASK						(~(3<<0))
#define AW862XX_BIT_DET_LO_RL							(3<<0)

/* TRIMCFG1: reg:0x58 RW */
#define AW862XX_BIT_TRIMCFG1_RL_TRIM_SRC_MASK			(~(1<<6))
#define AW862XX_BIT_TRIMCFG1_RL_TRIM_SRC_REG			(1<<6)
#define AW862XX_BIT_TRIMCFG1_RL_TRIM_SRC_EFUSE			(0<<6)
#define AW862XX_BIT_TRIMCFG1_TRIM_RL_MASK				(~(63<<0))

/* TRIMCFG3: reg:0x5A RW */
#define AW862XX_BIT_TRIMCFG3_OSC_TRIM_SRC_MASK			(~(1<<7))
#define AW862XX_BIT_TRIMCFG3_OSC_TRIM_SRC_REG			(1<<7)
#define AW862XX_BIT_TRIMCFG3_OSC_TRIM_SRC_EFUSE			(0<<7)
#define AW862XX_BIT_TRIMCFG3_TRIM_LRA_MASK				(~(63<<0))

/* TRIMCFG4: reg:0x5B RW */
/* TRIM_OSC */

/* ANACFG8: reg:0x77 RW */
#define AW862XX_BIT_ANACFG8_TRTF_CTRL_HDRV_MASK			(~(3<<6))
#define AW862XX_BIT_ANACFG8_TRTF_CTRL_HDRV				(3<<6)

/******************************************************
 * AW862X Register Detail
 *****************************************************/
 /* SYSST  0x01 */
#define AW862X_BIT_SYSST_OVS							(1<<6)
#define AW862X_BIT_SYSST_UVLS							(1<<5)
#define AW862X_BIT_SYSST_FF_AES							(1<<4)
#define AW862X_BIT_SYSST_FF_AFS							(1<<3)
#define AW862X_BIT_SYSST_OCDS							(1<<2)
#define AW862X_BIT_SYSST_OTS							(1<<1)
#define AW862X_BIT_SYSST_DONES							(1<<0)

 /* SYSINT  0x02 */
#define AW862X_BIT_SYSINT_OVI							(1<<6)
#define AW862X_BIT_SYSINT_UVLI							(1<<5)
#define AW862X_BIT_SYSINT_FF_AEI						(1<<4)
#define AW862X_BIT_SYSINT_FF_AFI						(1<<3)
#define AW862X_BIT_SYSINT_OCDI							(1<<2)
#define AW862X_BIT_SYSINT_OTI							(1<<1)
#define AW862X_BIT_SYSINT_DONEI							(1<<0)

 /* SYSINTM 0x03 */
#define AW862X_BIT_SYSINTM_OV_MASK						(~(1<<6))
#define AW862X_BIT_SYSINTM_OV_OFF						(1<<6)
#define AW862X_BIT_SYSINTM_OV_EN						(0<<6)
#define AW862X_BIT_SYSINTM_UVLO_MASK					(~(1<<5))
#define AW862X_BIT_SYSINTM_UVLO_OFF						(1<<5)
#define AW862X_BIT_SYSINTM_UVLO_EN						(0<<5)
#define AW862X_BIT_SYSINTM_FF_AE_MASK					(~(1<<4))
#define AW862X_BIT_SYSINTM_FF_AE_OFF					(1<<4)
#define AW862X_BIT_SYSINTM_FF_AE_EN						(0<<4)
#define AW862X_BIT_SYSINTM_FF_AF_MASK					(~(1<<3))
#define AW862X_BIT_SYSINTM_FF_AF_OFF					(1<<3)
#define AW862X_BIT_SYSINTM_FF_AF_EN						(0<<3)
#define AW862X_BIT_SYSINTM_OCD_MASK						(~(1<<2))
#define AW862X_BIT_SYSINTM_OCD_OFF						(1<<2)
#define AW862X_BIT_SYSINTM_OCD_EN						(0<<2)
#define AW862X_BIT_SYSINTM_OT_MASK						(~(1<<1))
#define AW862X_BIT_SYSINTM_OT_OFF						(1<<1)
#define AW862X_BIT_SYSINTM_OT_EN						(0<<1)
#define AW862X_BIT_SYSINTM_DONE_MASK					(~(1<<0))
#define AW862X_BIT_SYSINTM_DONE_OFF						(1<<0)
#define AW862X_BIT_SYSINTM_DONE_EN						(0<<0)

 /* SYSCTRL 0x04 */
#define AW862X_BIT_SYSCTRL_WAVDAT_MODE_MASK				(~(3<<6))
#define AW862X_BIT_SYSCTRL_WAVDAT_MODE_4X				(3<<6)
#define AW862X_BIT_SYSCTRL_WAVDAT_MODE_2X				(0<<6)
#define AW862X_BIT_SYSCTRL_WAVDAT_MODE_1X				(1<<6)
#define AW862X_BIT_SYSCTRL_RAMINIT_MASK					(~(1<<5))
#define AW862X_BIT_SYSCTRL_RAMINIT_EN					(1<<5)
#define AW862X_BIT_SYSCTRL_RAMINIT_OFF					(0<<5)
#define AW862X_BIT_SYSCTRL_PLAY_MODE_MASK				(~(3<<2))
#define AW862X_BIT_SYSCTRL_PLAY_MODE_CONT				(2<<2)
#define AW862X_BIT_SYSCTRL_PLAY_MODE_RTP				(1<<2)
#define AW862X_BIT_SYSCTRL_PLAY_MODE_RAM				(0<<2)
#define AW862X_BIT_SYSCTRL_WORK_MODE_MASK				(~(1<<0))
#define AW862X_BIT_SYSCTRL_STANDBY						(1<<0)
#define AW862X_BIT_SYSCTRL_ACTIVE						(0<<0)

 /* GO 0x05 */
#define AW862X_BIT_GO_MASK								(~(1<<0))
#define AW862X_BIT_GO_ENABLE							(1<<0)
#define AW862X_BIT_GO_DISABLE							(0<<0)

 /* WAVSEQ1 0x07 */
#define AW862X_BIT_WAVSEQ1_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ1_WAV_FRM_SEQ1_MASK			(~(127<<0))

 /* WAVSEQ2 0x08 */
#define AW862X_BIT_WAVSEQ2_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ2_WAV_FRM_SEQ2_MASK			(~(127<<0))

