Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
 /* WAVSEQ3 0x09 */
#define AW862X_BIT_WAVSEQ3_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ3_WAV_FRM_SEQ3_MASK			(~(127<<0))

 /* WAVSEQ4 0x0A */
#define AW862X_BIT_WAVSEQ4_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ4_WAV_FRM_SEQ4_MASK			(~(127<<0))

 /* WAVSEQ5 0X0B */
#define AW862X_BIT_WAVSEQ5_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ5_WAV_FRM_SEQ5_MASK			(~(127<<0))

 /* WAVSEQ6 0X0C */
#define AW862X_BIT_WAVSEQ6_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ6_WAV_FRM_SEQ6_MASK			(~(127<<0))

 /* WAVSEQ7 */
#define AW862X_BIT_WAVSEQ7_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ7_WAV_FRM_SEQ7_MASK			(~(127<<0))

 /* WAVSEQ8 */
#define AW862X_BIT_WAVSEQ8_WAIT							(1<<7)
#define AW862X_BIT_WAVSEQ8_WAV_FRM_SEQ8_MASK			(~(127<<0))

 /* WAVLOOP */
#define AW862X_BIT_WAVLOOP_SEQN_MASK					(~(15<<4))
#define AW862X_BIT_WAVLOOP_SEQNP1_MASK					(~(15<<0))
#define AW862X_BIT_WAVLOOP_INIFINITELY					(15<<0)

 /* WAVLOOP1 */
#define AW862X_BIT_WAVLOOP1_SEQ1_MASK					(~(15<<4))
#define AW862X_BIT_WAVLOOP1_SEQ2_MASK					(~(15<<0))

 /* WAVLOOP2 */
#define AW862X_BIT_WAVLOOP2_SEQ3_MASK					(~(15<<4))
#define AW862X_BIT_WAVLOOP2_SEQ4_MASK					(~(15<<0))

 /* WAVLOOP3 */
#define AW862X_BIT_WAVLOOP3_SEQ5_MASK					(~(15<<4))
#define AW862X_BIT_WAVLOOP3_SEQ6_MASK					(~(15<<0))

 /* WAVLOOP4 */
#define AW862X_BIT_WAVLOOP4_SEQ7_MASK					(~(15<<4))
#define AW862X_BIT_WAVLOOP4_SEQ8_MASK					(~(15<<0))

 /* TRGCFG1 */
#define AW862X_BIT_TRGCFG1_TRG1_POLAR_MASK				(~(1<<1))
#define AW862X_BIT_TRGCFG1_TRG1_POLAR_NEG				(1<<1)
#define AW862X_BIT_TRGCFG1_TRG1_POLAR_POS				(0<<1)
#define AW862X_BIT_TRGCFG1_TRG1_EDGE_MASK				(~(1<<0))
#define AW862X_BIT_TRGCFG1_TRG1_EDGE_POS				(1<<0)
#define AW862X_BIT_TRGCFG1_TRG1_EDGE_POS_NEG			(0<<0)

 /* TRGCFG2 */
#define AW862X_BIT_TRGCFG2_TRG1_ENABLE_MASK				(~(1<<0))
#define AW862X_BIT_TRGCFG2_TRG1_ENABLE					(1<<0)
#define AW862X_BIT_TRGCFG2_TRG1_DISABLE					(0<<0)

 /*DBGCTRL 0X20 */
#define AW862X_BIT_DBGCTRL_INTN_TRG_SEL_MASK			(~(1<<5))
#define AW862X_BIT_DBGCTRL_INTN_SEL_ENABLE				(1<<5)
#define AW862X_BIT_DBGCTRL_TRG_SEL_ENABLE				(0<<5)
#define AW862X_BIT_DBGCTRL_INT_MODE_MASK				(~(3<<2))
#define AW862X_BIT_DBGCTRL_INTN_LEVEL_MODE				(0<<2)
#define AW862X_BIT_DBGCTRL_INT_MODE_EDGE				(1<<2)
#define AW862X_BIT_DBGCTRL_INTN_POSEDGE_MODE			(2<<2)
#define AW862X_BIT_DBGCTRL_INTN_BOTH_EDGE_MODE			(3<<2)

 /* DATCTRL */
#define AW862X_BIT_DATCTRL_FC_MASK						(~(3<<6))
#define AW862X_BIT_DATCTRL_FC_1000HZ					(3<<6)
#define AW862X_BIT_DATCTRL_FC_800HZ						(3<<6)
#define AW862X_BIT_DATCTRL_FC_600HZ						(1<<6)
#define AW862X_BIT_DATCTRL_FC_400HZ						(0<<6)
#define AW862X_BIT_DATCTRL_LPF_ENABLE_MASK				(~(1<<5))
#define AW862X_BIT_DATCTRL_LPF_ENABLE					(1<<5)
#define AW862X_BIT_DATCTRL_LPF_DISABLE					(0<<5)

 /*PWMPRC 0X2D */
#define AW862X_BIT_PWMPRC_PRC_EN_MASK					(~(1<<7))
#define AW862X_BIT_PWMPRC_PRC_ENABLE					(1<<7)
#define AW862X_BIT_PWMPRC_PRC_DISABLE					(0<<7)
#define AW862X_BIT_PWMPRC_PRCTIME_MASK					(~(0x7f<<0))

 /* PWMDBG */
#define AW862X_BIT_PWMDBG_PWM_MODE_MASK					(~(3<<5))
#define AW862X_BIT_PWMDBG_PWM_12K						(3<<5)
#define AW862X_BIT_PWMDBG_PWM_24K						(2<<5)
#define AW862X_BIT_PWMDBG_PWM_48K						(0<<5)

/* GLB_STATE 0x47*/
#define AW862X_BIT_GLBRD5_STATE_MASK					(~(15<<0))
#define AW862X_BIT_GLBRD5_STATE							(15<<0)
#define AW862X_BIT_GLBRD5_STATE_STANDBY					(0<<0)
#define AW862X_BIT_GLBRD5_STATE_WAKEUP					(1<<0)
#define AW862X_BIT_GLBRD5_STATE_STARTUP					(2<<0)
#define AW862X_BIT_GLBRD5_STATE_WAIT					(3<<0)
#define AW862X_BIT_GLBRD5_STATE_CONT_GO					(6<<0)
#define AW862X_BIT_GLBRD5_STATE_RAM_GO					(7<<0)
#define AW862X_BIT_GLBRD5_STATE_RTP_GO					(8<<0)
#define AW862X_BIT_GLBRD5_STATE_TRIG_GO					(9<<0)
#define AW862X_BIT_GLBRD5_STATE_I2S_GO					(10<<0)
#define AW862X_BIT_GLBRD5_STATE_BRAKE					(11<<0)
#define AW862X_BIT_GLBRD5_STATE_END						(12<<0)

 /* WAVECTRL */
#define AW862X_BIT_WAVECTRL_NUM_OV_DRIVER_MASK			(~(0xF<<4))
#define AW862X_BIT_WAVECTRL_NUM_OV_DRIVER				(0<<4)

 /* CONT_CTRL */
#define AW862X_BIT_CONT_CTRL_ZC_DETEC_MASK				(~(1<<7))
#define AW862X_BIT_CONT_CTRL_ZC_DETEC_ENABLE			(1<<7)
#define AW862X_BIT_CONT_CTRL_ZC_DETEC_DISABLE			(0<<7)
#define AW862X_BIT_CONT_CTRL_WAIT_PERIOD_MASK			(~(3<<5))
#define AW862X_BIT_CONT_CTRL_WAIT_8PERIOD				(3<<5)
#define AW862X_BIT_CONT_CTRL_WAIT_4PERIOD				(2<<5)
#define AW862X_BIT_CONT_CTRL_WAIT_2PERIOD				(1<<5)
#define AW862X_BIT_CONT_CTRL_WAIT_1PERIOD				(0<<5)
#define AW862X_BIT_CONT_CTRL_MODE_MASK					(~(1<<4))
#define AW862X_BIT_CONT_CTRL_BY_DRV_TIME				(1<<4)
#define AW862X_BIT_CONT_CTRL_BY_GO_SIGNAL				(0<<4)
#define AW862X_BIT_CONT_CTRL_EN_CLOSE_MASK				(~(1<<3))
#define AW862X_BIT_CONT_CTRL_CLOSE_PLAYBACK				(1<<3)
#define AW862X_BIT_CONT_CTRL_OPEN_PLAYBACK				(0<<3)
#define AW862X_BIT_CONT_CTRL_F0_DETECT_MASK				(~(1<<2))
#define AW862X_BIT_CONT_CTRL_F0_DETECT_ENABLE			(1<<2)
#define AW862X_BIT_CONT_CTRL_F0_DETECT_DISABLE			(0<<2)
#define AW862X_BIT_CONT_CTRL_O2C_MASK					(~(1<<1))
#define AW862X_BIT_CONT_CTRL_O2C_ENABLE					(1<<1)
#define AW862X_BIT_CONT_CTRL_O2C_DISABLE				(0<<1)
#define AW862X_BIT_CONT_CTRL_AUTO_BRK_MASK				(~(1<<0))
#define AW862X_BIT_CONT_CTRL_AUTO_BRK_ENABLE			(1<<0)
#define AW862X_BIT_CONT_CTRL_AUTO_BRK_DISABLE			(0<<0)

#define AW862X_BIT_D2SCFG_CLK_ADC_MASK					(~(7<<5))
#define AW862X_BIT_D2SCFG_CLK_ASC_1P5MHZ				(3<<5)

#define AW862X_BIT_D2SCFG_GAIN_MASK						(~(7<<0))
#define AW862X_BIT_D2SCFG_GAIN_40						(7<<0)
 /* DETCTRL */
#define AW862X_BIT_DETCTRL_RL_OS_MASK					(~(1<<6))
#define AW862X_BIT_DETCTRL_RL_DETECT					(1<<6)
#define AW862X_BIT_DETCTRL_OS_DETECT					(0<<6)
#define AW862X_BIT_DETCTRL_PROTECT_MASK					(~(1<<5))
#define AW862X_BIT_DETCTRL_PROTECT_NO_ACTION			(1<<5)
#define AW862X_BIT_DETCTRL_PROTECT_SHUTDOWN				(0<<5)
#define AW862X_BIT_DETCTRL_VBAT_GO_MASK					(~(1<<1))
#define AW862X_BIT_DETCTRL_VABT_GO_ENABLE				(1<<1)
#define AW862X_BIT_DETCTRL_VBAT_GO_DISABLE				(0<<1)
#define AW862X_BIT_DETCTRL_DIAG_GO_MASK					(~(1<<0))
#define AW862X_BIT_DETCTRL_DIAG_GO_ENABLE				(1<<0)
#define AW862X_BIT_DETCTRL_DIAG_GO_DISABLE				(0<<0)


#define AW862X_BIT_RAMADDRH_MASK						(~(63<<0))

 /* VBAT MODE */
#define AW862X_BIT_DETCTRL_VBAT_MODE_MASK				(~(1<<6))
#define AW862X_BIT_DETCTRL_VBAT_HW_COMP					(1<<6)
#define AW862X_BIT_DETCTRL_VBAT_SW_COMP					(0<<6)


 /* ANACTRL */
#define AW862X_BIT_ANACTRL_LRA_SRC_MASK					(~(1<<5))
#define AW862X_BIT_ANACTRL_LRA_SRC_REG					(1<<5)
#define AW862X_BIT_ANACTRL_LRA_SRC_EFUSE				(0<<5)
#define AW862X_BIT_ANACTRL_EN_IO_PD1_MASK				(~(1<<0))
#define AW862X_BIT_ANACTRL_EN_IO_PD1_HIGH				(1<<0)
#define AW862X_BIT_ANACTRL_EN_IO_PD1_LOW				(0<<0)

/* PRLVL */
#define AW862X_BIT_PRLVL_PR_EN_MASK						(~(1<<7))
#define AW862X_BIT_PRLVL_PR_ENABLE						(1<<7)
#define AW862X_BIT_PRLVL_PR_DISABLE						(0<<7)
#define AW862X_BIT_PRLVL_PRLVL_MASK						(~(0x7f<<0))
#define AW862X_BIT_PRLVL_PRLVL_DEFAULT_VALUE			(0x3F)

/* PRTIME */
#define AW862X_REG_PRTIME_DEFAULT_VALUE					(0x12)
#define AW862X_BIT_PRTIME_PRTIME_MASK					(~(0xff<<0))

#define AW862X_BIT_BEMF_NUM_BRK_MASK					(~(0xf<<0))

/* TD_H 0x4b TD_brake */
#define AW862X_BIT_R_SPARE_MASK							(~(1<<7))
#define AW862X_BIT_R_SPARE_ENABLE						(1<<7)

/* TIME_NZC */
#define AW862X_BIT_TIME_NZC_DEF_VAL						(0x1f)

/* TRIM_LRA */
#define AW862X_BIT_TRIM_LRA								(0x3f<<0)
/******************************************************
 * AW8623X Register Detail
 *****************************************************/
/* SYSST: reg 0x01 RO */
#define AW8623X_BIT_SYSST_UVLS							(1<<5)
#define AW8623X_BIT_SYSST_FF_AES						(1<<4)
#define AW8623X_BIT_SYSST_FF_AFS						(1<<3)
#define AW8623X_BIT_SYSST_OCDS							(1<<2)
#define AW8623X_BIT_SYSST_OTS							(1<<1)
#define AW8623X_BIT_SYSST_DONES							(1<<0)

/* SYSINT: reg 0x02 RC */
#define AW8623X_BIT_SYSINT_UVLI							(1<<5)
#define AW8623X_BIT_SYSINT_FF_AEI						(1<<4)
#define AW8623X_BIT_SYSINT_FF_AFI						(1<<3)
#define AW8623X_BIT_SYSINT_OCDI							(1<<2)
#define AW8623X_BIT_SYSINT_OTI							(1<<1)
#define AW8623X_BIT_SYSINT_DONEI						(1<<0)

