Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/***************** TRIGGER *****************/
#define AW8623X_BIT_TRG_ENABLE_MASK						(~(1<<7))
#define AW8623X_BIT_TRG_ENABLE							(1<<7)
#define AW8623X_BIT_TRG_DISABLE							(0<<7)
#define AW8623X_BIT_TRG_SEQ_MASK						(~(0x7F<<0))

/* TRGCFG1: reg 0x33 RW */
#define AW8623X_BIT_TRGCFG1_TRG1_POS_MASK				(~(1<<7))
#define AW8623X_BIT_TRGCFG1_TRG1_POS_ENABLE				(1<<7)
#define AW8623X_BIT_TRGCFG1_TRG1_POS_DISABLE			(0<<7)
#define AW8623X_BIT_TRGCFG1_TRG1SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG2: reg 0x34 RW */
#define AW8623X_BIT_TRGCFG2_TRG2_POS_MASK				(~(1<<7))
#define AW8623X_BIT_TRGCFG2_TRG2_POS_ENABLE				(1<<7)
#define AW8623X_BIT_TRGCFG2_TRG2_POS_DISABLE			(0<<7)
#define AW8623X_BIT_TRGCFG2_TRG2SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG3: r3g 0x35 RW */
#define AW8623X_BIT_TRGCFG3_TRG3_POS_MASK				(~(1<<7))
#define AW8623X_BIT_TRGCFG3_TRG3_POS_ENABLE				(1<<7)
#define AW8623X_BIT_TRGCFG3_TRG3_POS_DISABLE			(0<<7)
#define AW8623X_BIT_TRGCFG3_TRG3SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG4: r3g 0x36 RW */
#define AW8623X_BIT_TRGCFG4_TRG1_NEG_MASK				(~(1<<7))
#define AW8623X_BIT_TRGCFG4_TRG1_NEG_ENABLE				(1<<7)
#define AW8623X_BIT_TRGCFG4_TRG1_NEG_DISABLE			(0<<7)
#define AW8623X_BIT_TRGCFG4_TRG1SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG5: r3g 0x37 RW */
#define AW8623X_BIT_TRGCFG5_TRG2_NEG_MASK				(~(1<<7))
#define AW8623X_BIT_TRGCFG5_TRG2_NEG_ENABLE				(1<<7)
#define AW8623X_BIT_TRGCFG5_TRG2_NEG_DISABLE			(0<<7)
#define AW8623X_BIT_TRGCFG5_TRG2SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG6: r3g 0x38 RW */
#define AW8623X_BIT_TRGCFG6_TRG3_NEG_MASK				~(1<<7))
#define AW8623X_BIT_TRGCFG6_TRG3_NEG_ENABLE				1<<7)
#define AW8623X_BIT_TRGCFG6_TRG3_NEG_DISABLE			0<<7)
#define AW8623X_BIT_TRGCFG6_TRG3SEQ_N_MASK				~(0x7F<<0))

/* TRGCFG7: reg 0x39 RW */
#define AW8623X_BIT_TRGCFG7_TRG1_POR_LEV_BRK_MASK		(~(7<<3))
#define AW8623X_BIT_TRGCFG7_TRG2_POR_LEV_BRK_MASK		(~(7<<0))
#define AW8623X_BIT_TRGCFG7_TRG1_POLAR_MASK				(~(1<<5))
#define AW8623X_BIT_TRGCFG7_TRG1_POLAR_NEG				(1<<5)
#define AW8623X_BIT_TRGCFG7_TRG1_POLAR_POS				(0<<5)
#define AW8623X_BIT_TRGCFG7_TRG1_MODE_MASK				(~(1<<4))
#define AW8623X_BIT_TRGCFG7_TRG1_MODE_LEVEL				(1<<4)
#define AW8623X_BIT_TRGCFG7_TRG1_MODE_EDGE				(0<<4)
#define AW8623X_BIT_TRGCFG7_TRG1_AUTO_BRK_MASK			(~(1<<3))
#define AW8623X_BIT_TRGCFG7_TRG1_AUTO_BRK_ENABLE		(1<<3)
#define AW8623X_BIT_TRGCFG7_TRG1_AUTO_BRK_DISABLE		(0<<3)
#define AW8623X_BIT_TRGCFG7_TRG2_POLAR_MASK				(~(1<<2))
#define AW8623X_BIT_TRGCFG7_TRG2_POLAR_NEG				(1<<2)
#define AW8623X_BIT_TRGCFG7_TRG2_POLAR_POS				(0<<2)
#define AW8623X_BIT_TRGCFG7_TRG2_MODE_MASK				(~(1<<1))
#define AW8623X_BIT_TRGCFG7_TRG2_MODE_LEVEL				(1<<1)
#define AW8623X_BIT_TRGCFG7_TRG2_MODE_EDGE				(0<<1)
#define AW8623X_BIT_TRGCFG7_TRG2_AUTO_BRK_MASK			(~(1<<0))
#define AW8623X_BIT_TRGCFG7_TRG2_AUTO_BRK_ENABLE		(1<<0)
#define AW8623X_BIT_TRGCFG7_TRG2_AUTO_BRK_DISABLE		(0<<0)

/* TRGCFG8: reg 0x3A RW */
#define AW8623X_BIT_TRGCFG8_TRG3_POR_LEV_BRK_MASK		(~(7<<3))
#define AW8623X_BIT_TRGCFG8_TRG3_POLAR_MASK				(~(1<<5))
#define AW8623X_BIT_TRGCFG8_TRG3_POLAR_NEG				(1<<5)
#define AW8623X_BIT_TRGCFG8_TRG3_POLAR_POS				(0<<5)
#define AW8623X_BIT_TRGCFG8_TRG3_MODE_MASK				(~(1<<4))
#define AW8623X_BIT_TRGCFG8_TRG3_MODE_LEVEL				(1<<4)
#define AW8623X_BIT_TRGCFG8_TRG3_MODE_EDGE				(0<<4)
#define AW8623X_BIT_TRGCFG8_TRG3_AUTO_BRK_MASK			(~(1<<3))
#define AW8623X_BIT_TRGCFG8_TRG3_AUTO_BRK_ENABLE		(1<<3)
#define AW8623X_BIT_TRGCFG8_TRG3_AUTO_BRK_DISABLE		(0<<3)
#define AW8623X_BIT_TRGCFG8_TRG1_STOP_MASK				(~(1<<2))
#define AW8623X_BIT_TRGCFG8_TRG1_STOP					(1<<2)
#define AW8623X_BIT_TRGCFG8_TRG2_STOP_MASK				(~(1<<1))
#define AW8623X_BIT_TRGCFG8_TRG2_STOP					(1<<1)
#define AW8623X_BIT_TRGCFG8_TRG3_STOP_MASK				(~(1<<0))
#define AW8623X_BIT_TRGCFG8_TRG3_STOP					(1<<0)

/* GLBCFG4: reg 0x3E RW */
#define AW8623X_BIT_GLBCFG4_GO_PRIO_MASK				(~(3<<6))
#define AW8623X_BIT_GLBCFG4_TRG3_PRIO_MASK				(~(3<<4))
#define AW8623X_BIT_GLBCFG4_TRG2_PRIO_MASK				(~(3<<2))
#define AW8623X_BIT_GLBCFG4_TRG1_PRIO_MASK				(~(3<<0))

/* GLBRD5: reg 0x3F R0 */
/* GLB_STATE */
#define AW8623X_BIT_GLBRD5_STATE						(15<<0)
#define AW8623X_BIT_GLBRD5_STATE_STANDBY				(0<<0)
#define AW8623X_BIT_GLBRD5_STATE_WAKEUP					(1<<0)
#define AW8623X_BIT_GLBRD5_STATE_STARTUP				(2<<0)
#define AW8623X_BIT_GLBRD5_STATE_WAIT					(3<<0)
#define AW8623X_BIT_GLBRD5_STATE_CONT_GO				(6<<0)
#define AW8623X_BIT_GLBRD5_STATE_RAM_GO					(7<<0)
#define AW8623X_BIT_GLBRD5_STATE_RTP_GO					(8<<0)
#define AW8623X_BIT_GLBRD5_STATE_TRIG_GO				(9<<0)
#define AW8623X_BIT_GLBRD5_STATE_I2S_GO					(10<<0)
#define AW8623X_BIT_GLBRD5_STATE_BRAKE					(11<<0)
#define AW8623X_BIT_GLBRD5_STATE_END					(12<<0)
/* RAMADDRH: reg 0x40 RWS */
#define AW8623X_BIT_RAMADDRH_MASK						(~(63<<0))

/* I2SCFG1: reg 0x44 RW */
#define AW8623X_BIT_I2SCFG1_I2S_EN_MASK					(~(1<<2))
#define AW8623X_BIT_I2SCFG1_I2S_ENABLE					(1<<2)
#define AW8623X_BIT_I2SCFG1_I2S_DISABLE					(0<<2)
#define AW8623X_BIT_I2SCFG1_I2S_MD_MASK					(~(1<<1))
#define AW8623X_BIT_I2SCFG1_I2S_MD_MSB					(1<<1)
#define AW8623X_BIT_I2SCFG1_I2S_MD_PHILIP				(0<<1)
#define AW8623X_BIT_I2SCFG1_I2S_SLOT_CHSEL_MASK			(~(1<<0))
#define AW8623X_BIT_I2SCFG1_I2S_SLOT_CHSEL_R_BEHIND		(1<<0)
#define AW8623X_BIT_I2SCFG1_I2S_SLOT_CHSEL_L_BEYOND		(0<<0)

/***************** SYSCTRL *****************/
/* SYSCTRL1: reg 0x45 RW */
#define AW8623X_BIT_SYSCTRL1_TRIG1_MODE_MASK			(~(7<<4))
#define AW8623X_BIT_SYSCTRL1_TRIG1_NONE					(7<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_AD					(6<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_RCK					(5<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_BCK					(4<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_TRIG					(3<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_ONE_WIRE				(2<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_PWM_ERM				(1<<4)
#define AW8623X_BIT_SYSCTRL1_TRIG1_PWM_LRA				(0<<4)
#define AW8623X_BIT_SYSCTRL1_GAIN_BYPASS_MASK			(~(1<<3))
#define AW8623X_BIT_SYSCTRL1_GAIN_CHANGE_ENABLE			(1<<3)
#define AW8623X_BIT_SYSCTRL1_GAIN_CHANGE_DISABLE		(0<<3)
#define AW8623X_BIT_SYSCTRL1_RAMINIT_MASK				(~(1<<2))
#define AW8623X_BIT_SYSCTRL1_RAMINIT_ON					(1<<2)
#define AW8623X_BIT_SYSCTRL1_RAMINIT_OFF				(0<<2)
#define AW8623X_BIT_SYSCTRL1_EN_FIR_MASK				(~(1<<1))
#define AW8623X_BIT_SYSCTRL1_FIR_ENABLE					(0<<1)
#define AW8623X_BIT_SYSCTRL1_INTN_PIN_MASK				(~(1<<0))
#define AW8623X_BIT_SYSCTRL1_INTN						(1<<0)
#define AW8623X_BIT_SYSCTRL1_TRIG1						(0<<0)

/* SYSCTRL2: reg 0x46 RW */
#define AW8623X_BIT_SYSCTRL2_WAKE_MASK					(~(1<<7))
#define AW8623X_BIT_SYSCTRL2_WAKE_ON					(1<<7)
#define AW8623X_BIT_SYSCTRL2_WAKE_OFF					(0<<7)
#define AW8623X_BIT_SYSCTRL2_STANDBY_MASK				(~(1<<6))
#define AW8623X_BIT_SYSCTRL2_STANDBY_ON					(1<<6)
#define AW8623X_BIT_SYSCTRL2_STANDBY_OFF				(0<<6)
#define AW8623X_BIT_SYSCTRL2_EN_DLL_MASK				(~(1<<5))
#define AW8623X_BIT_SYSCTRL2_EN_DLL						(1<<5)
#define AW8623X_BIT_SYSCTRL2_DISENABLE_DLL				(0<<5)
#define AW8623X_BIT_SYSCTRL2_RCK_FRE_MASK				(~(3<<3))
#define AW8623X_BIT_SYSCTRL2_RCK_FRE_96K				(3<<3)
#define AW8623X_BIT_SYSCTRL2_RCK_FRE_48K				(2<<3)
#define AW8623X_BIT_SYSCTRL2_RCK_FRE_32_768K			(1<<3)
#define AW8623X_BIT_SYSCTRL2_RCK_FRE_24K				(0<<3)
#define AW8623X_BIT_SYSCTRL2_EN_INTN_CLKOUT_MASK		(~(1<<2))
#define AW8623X_BIT_SYSCTRL2_EN_INTN_CLKOUT				(1<<2)
#define AW8623X_BIT_SYSCTRL2_DISENABLE_INTN_CLKOUT		(0<<2)
#define AW8623X_BIT_SYSCTRL2_WAVDAT_MODE_MASK			(~(3<<0))
#define AW8623X_BIT_SYSCTRL2_RATE						(3<<0)
#define AW8623X_BIT_SYSCTRL2_RATE_12K					(2<<0)
#define AW8623X_BIT_SYSCTRL2_RATE_24K					(0<<0)
#define AW8623X_BIT_SYSCTRL2_RATE_48K					(1<<0)

