Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/* SYSCTRL3: reg 0x47 RW */
#define AW8623X_BIT_SYSCTRL3_EN_TRIG1_PD_MASK			(~(1<<6))
#define AW8623X_BIT_SYSCTRL3_EN_TRIG1_PD				(1<<6)
#define AW8623X_BIT_SYSCTRL3_DISENABLE_TRIG1_PD			(0<<6)
#define AW8623X_BIT_SYSCTRL3_RTP_DLY_MASK				(~(3<<4))
#define AW8623X_BIT_SYSCTRL3_RTP_DLY_FIFO_AE			(3<<4)
#define AW8623X_BIT_SYSCTRL3_RTP_DLY_FIFO_8				(2<<4)
#define AW8623X_BIT_SYSCTRL3_RTP_DLY_FIFO_5				(1<<4)
#define AW8623X_BIT_SYSCTRL3_RTP_DLY_FIFO_1				(0<<4)
#define AW8623X_BIT_SYSCTRL3_INTMODE_MASK				(~(3<<2))
#define AW8623X_BIT_SYSCTRL3_INTMODE_BOTH_EDGE			(3<<2)
#define AW8623X_BIT_SYSCTRL3_INTMODE_LEVEL_1			(2<<2)
#define AW8623X_BIT_SYSCTRL3_INTMODE_POS_EDGE			(1<<2)
#define AW8623X_BIT_SYSCTRL3_INTMODE_LEVEL_2			(0<<2)
#define AW8623X_BIT_SYSCTRL3_INTP_MASK					(~(1<<1))
#define AW8623X_BIT_SYSCTRL3_INTP_ACTIVE_HIGH			(1<<1)
#define AW8623X_BIT_SYSCTRL3_INTP_ACTIVE_LOW			(0<<1)
#define AW8623X_BIT_SYSCTRL3_WAKE_MODE_MASK				(~(1<<0))
#define AW8623X_BIT_SYSCTRL3_WAKE_MODE_WAKEUP			(1<<0)
#define AW8623X_BIT_SYSCTRL3_WAKE_MODE_BST				(0<<0)

/* SYSCTRL5: reg 0x49 RW */
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_MASK			(~(7<<2))
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_VBAT_CTRL		(5<<2)
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_TRIG_ENG		(4<<2)
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_CONT_ENG		(3<<2)
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_RTP_ENG			(2<<2)
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_RAM_ENG			(1<<2)
#define AW8623X_BIT_SYSCTRL5_MODULE_SEL_EFUSE_ENG		(0<<2)
#define AW8623X_BIT_SYSCTRL5_DEV_ADDR_CTR_MASK			(~(3<<0))
#define AW8623X_BIT_SYSCTRL5_DEV_ADDR_CTR_HW_IRSW		(3<<0)
#define AW8623X_BIT_SYSCTRL5_DEV_ADDR_CTR_HW_1			(2<<0)
#define AW8623X_BIT_SYSCTRL5_DEV_ADDR_CTR_IRSW			(1<<0)
#define AW8623X_BIT_SYSCTRL5_DEV_ADDR_CTR_HW_2			(0<<0)

/* PWMCFG1: reg 0x4A RW */
#define AW8623X_BIT_PWMCFG1_PRC_EN_MASK					(~(1<<7))
#define AW8623X_BIT_PWMCFG1_PRC_ENABLE					(1<<7)
#define AW8623X_BIT_PWMCFG1_PRC_DISABLE					(0<<7)
#define AW8623X_BIT_PWMCFG1_PRCTIME_MASK				(~(0x7F<<0))

/* PWMCFG2: reg 0x4B RW */
#define AW8623X_BIT_PWMCFG2_PRCT_MODE_MASK				(~(1<<6))
#define AW8623X_BIT_PWMCFG2_PRCT_MODE_VALID				(1<<6)
#define AW8623X_BIT_PWMCFG2_PRCT_MODE_INVALID			(0<<6)
#define AW8623X_BIT_PWMCFG2_REF_SEL_MASK				(~(1<<5))
#define AW8623X_BIT_PWMCFG2_REF_SEL_TRIANGLE			(1<<5)
#define AW8623X_BIT_PWMCFG2_REF_SEL_SAWTOOTH			(0<<5)
#define AW8623X_BIT_PWMCFG2_PD_HWM_MASK					(~(1<<4))
#define AW8623X_BIT_PWMCFG2_PD_HWM_FULL					(1<<4)
#define AW8623X_BIT_PWMCFG2_PD_HWM_HALF					(0<<4)
#define AW8623X_BIT_PWMCFG2_PWMOE_MASK					(~(1<<3))
#define AW8623X_BIT_PWMCFG2_PWMOE_ON					(1<<3)
#define AW8623X_BIT_PWMCFG2_PWMOE_OFF					(0<<3)
#define AW8623X_BIT_PWMCFG2_PWMFRC_MASK					(~(7<<0))

/* PWMCFG3: reg 0x4C RW */
#define AW8623X_BIT_PWMCFG3_PR_EN_MASK					(~(1<<7))
#define AW8623X_BIT_PWMCFG3_PR_ENABLE					(1<<7)
#define AW8623X_BIT_PWMCFG3_PR_DISABLE					(0<<7)
#define AW8623X_BIT_PWMCFG3_PRLVL_MASK					(~(0x7F<<0))
#define AW8623X_BIT_PWMCFG3_PRLVL_DEFAULT_VALUE			(0x3F)

/* PWMCFG4: reg 0x4D RW */
/* PRTIME */
#define AW8623X_PWMCFG4_PRTIME_DEFAULT_VALUE			(0x32)

/* VBATCTRL: reg 0x4E RW */
#define AW8623X_BIT_VBATCTRL_VBAT_PRO_MASK				(~(1<<7))
#define AW8623X_BIT_VBATCTRL_VBAT_PRO_ENABLE			(1<<7)
#define AW8623X_BIT_VBATCTRL_VBAT_PRO_DISABLE			(0<<7)
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_MASK				(~(1<<6))
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_HW				(1<<6)
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_SW				(0<<6)
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_CON_MASK			(~(1<<5))
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_CON_DURING		(1<<5)
#define AW8623X_BIT_VBATCTRL_VBAT_MODE_CON_BEFORE		(0<<5)
#define AW8623X_BIT_VBATCTRL_DELTA_VBAT_MASK			(~(1<<4))
#define AW8623X_BIT_VBATCTRL_DELTA_VBAT_0_2				(1<<4)
#define AW8623X_BIT_VBATCTRL_DELTA_VBAT_0_1				(0<<4)
#define AW8623X_BIT_VBATCTRL_REL_VBAT_MASK				(~(3<<2))
#define AW8623X_BIT_VBATCTRL_REL_VBAT_100				(3<<2)
#define AW8623X_BIT_VBATCTRL_REL_VBAT_50				(2<<2)
#define AW8623X_BIT_VBATCTRL_REL_VBAT_25				(1<<2)
#define AW8623X_BIT_VBATCTRL_REL_VBAT_10				(0<<2)
#define AW8623X_BIT_VBATCTRL_ABS_VBAT_MASK				(~(3<<0))
#define AW8623X_BIT_VBATCTRL_ABS_VBAT_3_5				(3<<0)
#define AW8623X_BIT_VBATCTRL_ABS_VBAT_3_4				(2<<0)
#define AW8623X_BIT_VBATCTRL_ABS_VBAT_3_3				(1<<0)
#define AW8623X_BIT_VBATCTRL_ABS_VBAT_3_2				(0<<0)

/* DETCFG1: reg 0x4F RW */
#define AW8623X_BIT_DETCFG1_EN_VBAT_AVG_MASK			(~(1<<7))
#define AW8623X_BIT_DETCFG1_EN_VBAT_AVG_16_TIMES		(1<<7)
#define AW8623X_BIT_DETCFG1_VBAT_REF_MASK				(~(7<<4))
#define AW8623X_BIT_DETCFG1_VBAT_REF_5_5				(7<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_5_0				(6<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_4_8				(5<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_4_5				(4<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_4_2				(3<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_4_0				(2<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_3_6				(1<<4)
#define AW8623X_BIT_DETCFG1_VBAT_REF_3_3				(0<<4)
#define AW8623X_BIT_DETCFG1_ADC_FS_MASK					(~(3<<2))
#define AW8623X_BIT_DETCFG1_ADC_FS_24K					(3<<2)
#define AW8623X_BIT_DETCFG1_ADC_FS_48K					(2<<2)
#define AW8623X_BIT_DETCFG1_ADC_FS_96K					(1<<2)
#define AW8623X_BIT_DETCFG1_ADC_FS_192K					(0<<2)
#define AW8623X_BIT_DETCFG1_DET_GO_MASK					(~(3<<0))
#define AW8623X_BIT_DETCFG1_DET_GO_ON					(1<<0)
#define AW8623X_BIT_DETCFG1_DET_GO_OFF					(0<<0)

/* DETCFG2: reg 0x50 RW */
#define AW8623X_BIT_DETCFG2_DET_SEQ0_MASK				(~(0X0F<<3))
#define AW8623X_BIT_DETCFG2_DET_SEQ0_HDN_1				(0x0E<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_HDN_2				(0x0A<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_HDP_1				(0x0D<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_HDP_2				(9<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_FTS				(6<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_VOUT				(5<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_OS					(4<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_RL					(3<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_TRIG1				(2<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_PVDD				(1<<3)
#define AW8623X_BIT_DETCFG2_DET_SEQ0_VBAT				(0<<3)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_MASK				(~(7<<0))
#define AW8623X_BIT_DETCFG2_D2S_GAIN_40					(7<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_20					(6<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_10					(5<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_8					(4<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_5					(3<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_4					(2<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_2					(1<<0)
#define AW8623X_BIT_DETCFG2_D2S_GAIN_1					(0<<0)

/* DETRD1: reg 0x51 RO */
#define AW8623X_BIT_DETRD1_AVG_DATA_H_MASK				(~(3<<0))

/* TRIMCFG1: reg 0x59 RW */
#define AW8623X_BIT_TRIMCFG1_RL_TRIM_SRC_MASK			(~(1<<7))
#define AW8623X_BIT_TRIMCFG1_RL_TRIM_SRC_REG			(1<<7)
#define AW8623X_BIT_TRIMCFG1_RL_TRIM_SRC_EFUSE			(0<<7)
#define AW8623X_BIT_TRIMCFG1_TRIM_RL_MASK				(~(0x7F<<0))

/* TRIMCFG2: reg 0x5A RW */
#define AW8623X_BIT_TRIMCFG2_OSC_TRIM_SRC_MASK			(~(1<<6))
#define AW8623X_BIT_TRIMCFG2_OSC_TRIM_SRC_REG			(1<<6)
#define AW8623X_BIT_TRIMCFG2_OSC_TRIM_SRC_EFUSE			(0<<6)
#define AW8623X_BIT_TRIMCFG2_TRIM_LRA_MASK				(~(0x3F<<0))

