Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/* CONTCFG6: reg 0x1D RW */
#define AW8624X_BIT_CONTCFG6_TRACK_EN_MASK				(~(1<<7))
#define AW8624X_BIT_CONTCFG6_TRACK_ENABLE				(1<<7)
#define AW8624X_BIT_CONTCFG6_TRACK_DISABLE				(0<<7)
#define AW8624X_BIT_CONTCFG6_DRV1_LVL_MASK				(~(0x7F<<0))

/* CONTCFG7: reg 0x1E RW */
#define AW8624X_BIT_CONTCFG7_DRV_SWITCH_MASK			(~(1<<7))
#define AW8624X_BIT_CONTCFG7_DRV_SWITCH_ENABLE			(1<<7)
#define AW8624X_BIT_CONTCFG7_DRV_SWITCH_DISABLE			(0<<7)
#define AW8624X_BIT_CONTCFG7_DRV2_LVL_MASK				(~(0x7F<<0))

/* CONTRD20: reg 0x2B RO */
#define AW8624X_BIT_CONTRD20_BEMF_PEAK4_L_MASK			(~(3<<6))
#define AW8624X_BIT_CONTRD20_BEMF_PEAK3_L_MASK			(~(3<<4))
#define AW8624X_BIT_CONTRD20_BEMF_PEAK2_L_MASK			(~(3<<2))
#define AW8624X_BIT_CONTRD20_BEMF_PEAK1_L_MASK			(~(3<<0))

/* CONTRD21: reg 0x2C RO */
#define AW8624X_BIT_CONTRD21_BEMF_PEAK5_L_MASK			(~(3<<0))

/***************** RTP *****************/
/* RTPCFG1: reg 0x2D RW */
#define AW8624X_BIT_RTPCFG1_ADDRH_MASK					(~(0x0F<<0))

/* RTPCFG3: reg 0x2F RW */
#define AW8624X_BIT_RTPCFG3_FIFO_AEH_MASK				(~(0x0F<<4))
#define AW8624X_BIT_RTPCFG3_FIFO_AFH_MASK				(~(0x0F<<0))
#define AW8624X_BIT_RTPCFG3_FIFO_AEH					(0x0F<<4)
#define AW8624X_BIT_RTPCFG3_FIFO_AFH					(0x0F<<0)

/***************** TRIGGER *****************/
#define AW8624X_BIT_TRG_ENABLE_MASK						(~(1<<7))
#define AW8624X_BIT_TRG_ENABLE							(1<<7)
#define AW8624X_BIT_TRG_DISABLE							(0<<7)
#define AW8624X_BIT_TRG_SEQ_MASK						(~(0x7F<<0))

/* TRGCFG1: reg 0x33 RW */
#define AW8624X_BIT_TRGCFG1_TRG1_POS_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG1_TRG1_POS_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG1_TRG1_POS_DISABLE			(0<<7)
#define AW8624X_BIT_TRGCFG1_TRG1SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG2: reg 0x34 RW */
#define AW8624X_BIT_TRGCFG2_TRG2_POS_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG2_TRG2_POS_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG2_TRG2_POS_DISABLE			(0<<7)
#define AW8624X_BIT_TRGCFG2_TRG2SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG3: reg 0x35 RW */
#define AW8624X_BIT_TRGCFG3_TRG3_POS_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG3_TRG3_POS_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG3_TRG3_POS_DISABLE			(0<<7)
#define AW8624X_BIT_TRGCFG3_TRG3SEQ_P_MASK				(~(0x7F<<0))

/* TRGCFG4: reg 0x36 RW */
#define AW8624X_BIT_TRGCFG4_TRG1_NEG_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG4_TRG1_NEG_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG4_TRG1_NEG_DISABLE			(0<<7)
#define AW8624X_BIT_TRGCFG4_TRG1SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG5: reg 0x37 RW */
#define AW8624X_BIT_TRGCFG5_TRG2_NEG_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG5_TRG2_NEG_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG5_TRG2_NEG_DISABLE			(0<<7)
#define AW8624X_BIT_TRGCFG5_TRG2SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG6: reg 0x38 RW */
#define AW8624X_BIT_TRGCFG6_TRG3_NEG_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG6_TRG3_NEG_ENABLE				(1<<7)
#define AW8624X_BIT_TRGCFG6_TRG3_NEG_DISABLE			(0<<7)
#define AW862XX_BIT_TRGCFG6_TRG3SEQ_N_MASK				(~(0x7F<<0))

/* TRGCFG7: reg 0x39 RW */
#define AW8624X_BIT_TRGCFG7_TRG1_POR_LEV_BRK_MASK		(~(7<<5))
#define AW8624X_BIT_TRGCFG7_TRG2_POR_LEV_BRK_MASK		(~(7<<1))
#define AW8624X_BIT_TRGCFG7_TRG1_POLAR_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG7_TRG1_POLAR_NEG				(1<<7)
#define AW8624X_BIT_TRGCFG7_TRG1_POLAR_POS				(0<<7)
#define AW8624X_BIT_TRGCFG7_TRG1_MODE_MASK				(~(1<<6))
#define AW8624X_BIT_TRGCFG7_TRG1_MODE_LEVEL				(1<<6)
#define AW8624X_BIT_TRGCFG7_TRG1_MODE_EDGE				(0<<6)
#define AW8624X_BIT_TRGCFG7_TRG1_AUTO_BRK_MASK			(~(1<<5))
#define AW8624X_BIT_TRGCFG7_TRG1_AUTO_BRK_ENABLE		(1<<5)
#define AW8624X_BIT_TRGCFG7_TRG1_AUTO_BRK_DISABLE		(0<<5)
#define AW8624X_BIT_TRGCFG7_TRG2_POLAR_MASK				(~(1<<3))
#define AW8624X_BIT_TRGCFG7_TRG2_POLAR_NEG				(1<<3)
#define AW8624X_BIT_TRGCFG7_TRG2_POLAR_POS				(0<<3)
#define AW8624X_BIT_TRGCFG7_TRG2_MODE_MASK				(~(1<<2))
#define AW8624X_BIT_TRGCFG7_TRG2_MODE_LEVEL				(1<<2)
#define AW8624X_BIT_TRGCFG7_TRG2_MODE_EDGE				(0<<2)
#define AW8624X_BIT_TRGCFG7_TRG2_AUTO_BRK_MASK			(~(1<<1))
#define AW8624X_BIT_TRGCFG7_TRG2_AUTO_BRK_ENABLE		(1<<1)
#define AW8624X_BIT_TRGCFG7_TRG2_AUTO_BRK_DISABLE		(0<<1)

/* TRGCFG8: reg 0x3A RW */
#define AW8624X_BIT_TRGCFG8_TRG3_POR_LEV_BRK_MASK		(~(7<<5))
#define AW8624X_BIT_TRGCFG8_TRG3_POLAR_MASK				(~(1<<7))
#define AW8624X_BIT_TRGCFG8_TRG3_POLAR_NEG				(1<<7)
#define AW8624X_BIT_TRGCFG8_TRG3_POLAR_POS				(0<<7)
#define AW8624X_BIT_TRGCFG8_TRG3_MODE_MASK				(~(1<<6))
#define AW8624X_BIT_TRGCFG8_TRG3_MODE_LEVEL				(1<<6)
#define AW8624X_BIT_TRGCFG8_TRG3_MODE_EDGE				(0<<6)
#define AW8624X_BIT_TRGCFG8_TRG3_AUTO_BRK_MASK			(~(1<<5))
#define AW8624X_BIT_TRGCFG8_TRG3_AUTO_BRK_ENABLE		(1<<5)
#define AW8624X_BIT_TRGCFG8_TRG3_AUTO_BRK_DISABLE		(0<<5)
#define AW8624X_BIT_TRGCFG8_TRG1_STOP_MASK				(~(1<<2))
#define AW8624X_BIT_TRGCFG8_TRG1_STOP					(1<<2)
#define AW8624X_BIT_TRGCFG8_TRG2_STOP_MASK				(~(1<<1))
#define AW8624X_BIT_TRGCFG8_TRG2_STOP					(1<<1)
#define AW8624X_BIT_TRGCFG8_TRG3_STOP_MASK				(~(1<<0))
#define AW8624X_BIT_TRGCFG8_TRG3_STOP					(1<<0)

/* GLBCFG2: reg 0x3C RW */
/* START_DLY */
#define AW8624X_BIT_GLBCFG2_START_DLY_250US				(0x0C)

/* GLBCFG4: reg 0x3E RW */
#define AW8624X_BIT_GLBCFG4_GO_PRIO_MASK				(~(3<<6))
#define AW8624X_BIT_GLBCFG4_TRG3_PRIO_MASK				(~(3<<4))
#define AW8624X_BIT_GLBCFG4_TRG2_PRIO_MASK				(~(3<<2))
#define AW8624X_BIT_GLBCFG4_TRG1_PRIO_MASK				(~(3<<0))

/* SYSCTRL1: reg 0x43 RW */
#define AW8624X_BIT_SYSCTRL1_VBAT_MODE_MASK				(~(1<<7))
#define AW8624X_BIT_SYSCTRL1_VBAT_MODE_HW				(1<<7)
#define AW8624X_BIT_SYSCTRL1_VBAT_MODE_SW				(0<<7)
#define AW8624X_BIT_SYSCTRL1_INT_BRK_MASK				(~(1<<6))
#define AW8624X_BIT_SYSCTRL1_INT_BRK_ON					(1<<6)
#define AW8624X_BIT_SYSCTRL1_INT_BRK_OFF				(0<<6)
#define AW8624X_BIT_SYSCTRL1_RCK_FRE_MASK				(~(3<<4))
#define AW8624X_BIT_SYSCTRL1_RCK_FRE_127				(3<<4)
#define AW8624X_BIT_SYSCTRL1_RCK_FRE_255				(2<<4)
#define AW8624X_BIT_SYSCTRL1_RCK_FRE_374				(1<<4)
#define AW8624X_BIT_SYSCTRL1_RCK_FRE_511				(0<<4)
#define AW8624X_BIT_SYSCTRL1_RAMINIT_MASK				(~(1<<3))
#define AW8624X_BIT_SYSCTRL1_RAMINIT_ON					(1<<3)
#define AW8624X_BIT_SYSCTRL1_RAMINIT_OFF				(0<<3)
#define AW8624X_BIT_SYSCTRL1_EN_FIR_MASK				(~(1<<2))
#define AW8624X_BIT_SYSCTRL1_FIR_ENABLE					(0<<2)
#define AW8624X_BIT_SYSCTRL1_WAKE_MODE_MASK				(~(1<<1))
#define AW8624X_BIT_SYSCTRL1_WAKE_MODE_WAKEUP			(1<<1)
#define AW8624X_BIT_SYSCTRL1_WAKE_MODE_BST				(0<<1)
#define AW8624X_BIT_SYSCTRL1_RTP_CLK_MASK				(~(1<<0))
#define AW8624X_BIT_SYSCTRL1_RTP_PLL					(1<<0)
#define AW8624X_BIT_SYSCTRL1_RTP_OSC					(0<<0)

/* SYSCTRL2: reg 0x44 RW */
#define AW8624X_BIT_SYSCTRL2_WAKE_MASK					(~(1<<7))
#define AW8624X_BIT_SYSCTRL2_WAKE_ON					(1<<7)
#define AW8624X_BIT_SYSCTRL2_WAKE_OFF					(0<<7)
#define AW8624X_BIT_SYSCTRL2_STANDBY_MASK				(~(1<<6))
#define AW8624X_BIT_SYSCTRL2_STANDBY_ON					(1<<6)
#define AW8624X_BIT_SYSCTRL2_STANDBY_OFF				(0<<6)
#define AW8624X_BIT_SYSCTRL2_RTP_DLY_MASK				(~(3<<4))
#define AW8624X_BIT_SYSCTRL2_WAIT_NHZ_MASK				(~(1<<3))
#define AW8624X_BIT_SYSCTRL2_WAIT_NHZ_ENABLE			(0<<3)
#define AW8624X_BIT_SYSCTRL2_WAIT_NHZ_DISABLE			(1<<3)
#define AW8624X_BIT_SYSCTRL2_WCK_PIN_MASK				(~(1<<2))
#define AW8624X_BIT_SYSCTRL2_ENABLE_TRIG1				(1<<2)
#define AW8624X_BIT_SYSCTRL2_DISENABLE_TRIG1			(0<<2)
#define AW8624X_BIT_SYSCTRL2_WAVDAT_MODE_MASK			(~(3<<0))
#define AW8624X_BIT_SYSCTRL2_RATE						(3<<0)
#define AW8624X_BIT_SYSCTRL2_RATE_12K					(2<<0)
#define AW8624X_BIT_SYSCTRL2_RATE_48K					(1<<0)
#define AW8624X_BIT_SYSCTRL2_RATE_24K					(0<<0)

/* SYSCTRL3: reg 0x45 RW */
#define AW8624X_BIT_SYSCTRL3_TSET_MASK					(~(0x0F<<4))
#define AW8624X_BIT_SYSCTRL3_BEMF_SET_MASK				(~(0x0F<<0))

/* SYSCTRL5: reg 0x49 RW */
#define AW8624X_BIT_SYSCTRL5_INTBRK_MD_MASK				(~(1<<7))
#define AW8624X_BIT_SYSCTRL5_INTBRK_MD_ENABLE			(1<<7)
#define AW8624X_BIT_SYSCTRL5_INTBRK_MD_DISABLE			(0<<7)
#define AW8624X_BIT_SYSCTRL5_GAIN_BYPASS_MASK			(~(1<<6))
#define AW8624X_BIT_SYSCTRL5_GAIN_CHANGEABLE			(1<<6)
#define AW8624X_BIT_SYSCTRL5_GAIN_FIXED					(0<<6)
#define AW8624X_BIT_SYSCTRL5_INT_EDGE_MODE_MASK			(~(1<<5))
#define AW8624X_BIT_SYSCTRL5_INT_EDGE_MODE_POS			(0<<5)
#define AW8624X_BIT_SYSCTRL5_INT_EDGE_MODE_BOTH			(1<<5)
#define AW8624X_BIT_SYSCTRL5_INT_MODE_MASK				(~(1<<4))
#define AW8624X_BIT_SYSCTRL5_INT_MODE_EDGE				(1<<4)
#define AW8624X_BIT_SYSCTRL5_INT_MODE_LEVEL				(0<<4)
#define AW8624X_BIT_SYSCTRL5_INTP_MASK					(~(1<<3))
#define AW8624X_BIT_SYSCTRL5_INTP_HIGH					(1<<3)
#define AW8624X_BIT_SYSCTRL5_INTP_LOW					(0<<3)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_MASK				(~(7<<0))
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_1					(0<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_2					(1<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_4					(2<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_5					(3<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_8					(4<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_10				(5<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_20				(6<<0)
#define AW8624X_BIT_SYSCTRL5_D2S_GAIN_40				(7<<0)

/* SYSCTRL6: reg 0x4A RW */
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_MASK			(~(7<<0))
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_1				(0<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_2				(1<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_4				(2<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_5				(3<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_8				(4<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_10				(5<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_20				(6<<0)
#define AW8624X_BIT_SYSCTRL6_F0_D2S_GAIN_40				(7<<0)

/* PWMCFG1: reg 0x4C RW */
#define AW8624X_BIT_PWMCFG1_PRC_EN_MASK					(~(1<<7))
#define AW8624X_BIT_PWMCFG1_PRC_ENABLE					(1<<7)
#define AW8624X_BIT_PWMCFG1_PRC_DISABLE					(0<<7)
#define AW8624X_BIT_PWMCFG1_PRCTIME_MASK				(~(0x7F<<0))

/* PWMCFG3: reg 0x4E RW */
#define AW8624X_BIT_PWMCFG3_PR_EN_MASK					(~(1<<7))
#define AW8624X_BIT_PWMCFG3_PR_ENABLE					(1<<7)
#define AW8624X_BIT_PWMCFG3_PR_DISABLE					(0<<7)
#define AW8624X_BIT_PWMCFG3_PRLVL_MASK					(~(0x7F<<0))
#define AW8624X_BIT_PWMCFG3_PRLVL_DEFAULT_VALUE			(0x3F)

