Yang1234Li/smart_pen/nRF5_SDK_17.1.0_ddde560/components/drivers_ext/aw8623x/haptic_nv_reg.h
/* PWMCFG4: reg 0x4F RW */
/* PRTIME */
#define AW8624X_PWMCFG4_PRTIME_DEFAULT_VALUE			(0x32)

/* DET_LO: reg 0x50 RO */
#define AW8624X_BIT_DET_LO_TEST_LO_MASK					(~(3<<6))
#define AW8624X_BIT_DET_LO_VBAT_LO_MASK					(~(3<<4))
#define AW8624X_BIT_DET_LO_VBAT							(3<<4)
#define AW8624X_BIT_DET_LO_OS_MASK						(~(3<<2))
#define AW8624X_BIT_DET_LO_RL_MASK						(~(3<<0))
#define AW8624X_BIT_DET_LO_RL							(3<<0)

/* DETCFG1: reg 0x51 RW */
#define AW8624X_BIT_DETCFG1_FTS_GO_MASK					(~(1<<7))
#define AW8624X_BIT_DETCFG1_FTS_GO_ENABLE				(1<<7)
#define AW8624X_BIT_DETCFG1_TEST_GO_MASK				(~(1<<6))
#define AW8624X_BIT_DETCFG1_TEST_GO_ENABLE				(1<<6)
#define AW8624X_BIT_DETCFG1_ADO_SLOT_MODE_MASK			(~(1<<5))
#define AW8624X_BIT_DETCFG1_ADO_SLOT_ADC_32				(1<<5)
#define AW8624X_BIT_DETCFG1_ADO_SLOT_ADC_256			(0<<5)
#define AW8624X_BIT_DETCFG1_RL_OS_MASK					(~(1<<4))
#define AW8624X_BIT_DETCFG1_RL							(1<<4)
#define AW8624X_BIT_DETCFG1_OS							(0<<4)
#define AW8624X_BIT_DETCFG1_PRCT_MODE_MASK				(~(1<<3))
#define AW8624X_BIT_DETCFG1_PRCT_MODE_INVALID			(0<<3)
#define AW8624X_BIT_DETCFG1_PRCT_MODE_VALID				(1<<3)
#define AW8624X_BIT_DETCFG1_CLK_ADC_MASK				(~(7<<0))
#define AW8624X_BIT_DETCFG1_CLK_ADC_12M					(0<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_6M					(1<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_3M					(2<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_1M5					(3<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_M75					(4<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_M37					(5<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_M18					(6<<0)
#define AW8624X_BIT_DETCFG1_CLK_ADC_M09					(7<<0)

/* DETCFG2: reg 0x52 RW */
#define AW8624X_BIT_DETCFG2_VBAT_GO_MASK				(~(1<<1))
#define AW8624X_BIT_DETCFG2_VABT_GO_ON					(1<<1)
#define AW8624X_BIT_DETCFG2_DIAG_GO_MASK				(~(1<<0))
#define AW8624X_BIT_DETCFG2_DIAG_GO_ON					(1<<0)

/* TRIMCFG1: reg:0x59 RW */
#define AW8624X_BIT_TRIMCFG1_RL_TRIM_SRC_MASK			(~(1<<6))
#define AW8624X_BIT_TRIMCFG1_RL_TRIM_SRC_REG			(1<<6)
#define AW8624X_BIT_TRIMCFG1_RL_TRIM_SRC_EFUSE			(0<<6)
#define AW8624X_BIT_TRIMCFG1_TRIM_RL_MASK				(~(63<<0))

/* TRIMCFG3: reg:0x5A RW */
#define AW8624X_BIT_TRIMCFG3_OSC_TRIM_SRC_MASK			(~(1<<7))
#define AW8624X_BIT_TRIMCFG3_OSC_TRIM_SRC_REG			(1<<7)
#define AW8624X_BIT_TRIMCFG3_OSC_TRIM_SRC_EFUSE			(0<<7)
#define AW8624X_BIT_TRIMCFG3_TRIM_LRA_MASK				(~(0x7F<<0))

/* EFRD9: reg:0x64 RO */

/* ANACFG8: reg:0x77 RW */
#define AW8624X_BIT_ANACFG8_TRTF_CTRL_HDRV_MASK			(~(3<<6))
#define AW8624X_BIT_ANACFG8_TRTF_CTRL_HDRV				(3<<6)

#endif
